-- MySQL dump 10.13  Distrib 8.0.46, for Win64 (x86_64)
--
-- Host: localhost    Database: pet_adoption_db
-- ------------------------------------------------------
-- Server version	8.0.46

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!50503 SET NAMES utf8 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `adoption_approvals`
--

DROP TABLE IF EXISTS `adoption_approvals`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `adoption_approvals` (
  `approval_id` int NOT NULL AUTO_INCREMENT,
  `match_id` int NOT NULL,
  `approver_id` int NOT NULL,
  `approver_status` enum('waiting','approved','rejected') COLLATE utf8mb4_unicode_ci DEFAULT 'waiting',
  `approver_remark` text COLLATE utf8mb4_unicode_ci,
  `verified_date` datetime DEFAULT CURRENT_TIMESTAMP,
  PRIMARY KEY (`approval_id`),
  KEY `match_id` (`match_id`),
  KEY `approver_id` (`approver_id`),
  CONSTRAINT `adoption_approvals_ibfk_1` FOREIGN KEY (`match_id`) REFERENCES `adoptionapplications` (`match_id`),
  CONSTRAINT `adoption_approvals_ibfk_2` FOREIGN KEY (`approver_id`) REFERENCES `users` (`user_id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `adoption_approvals`
--

LOCK TABLES `adoption_approvals` WRITE;
/*!40000 ALTER TABLE `adoption_approvals` DISABLE KEYS */;
/*!40000 ALTER TABLE `adoption_approvals` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `adoptionapplications`
--

DROP TABLE IF EXISTS `adoptionapplications`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `adoptionapplications` (
  `match_id` int NOT NULL AUTO_INCREMENT,
  `cat_id` int NOT NULL,
  `applicant_id` int NOT NULL,
  `matchscore` decimal(10,0) DEFAULT NULL,
  `status` enum('pending','interview','approved','rejected') COLLATE utf8mb4_unicode_ci DEFAULT 'pending',
  `applied_at` datetime DEFAULT CURRENT_TIMESTAMP,
  `upload_remark` varchar(255) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  PRIMARY KEY (`match_id`),
  KEY `cat_id` (`cat_id`),
  KEY `applicant_id` (`applicant_id`),
  CONSTRAINT `adoptionapplications_ibfk_1` FOREIGN KEY (`cat_id`) REFERENCES `cats` (`cat_id`),
  CONSTRAINT `adoptionapplications_ibfk_2` FOREIGN KEY (`applicant_id`) REFERENCES `users` (`user_id`)
) ENGINE=InnoDB AUTO_INCREMENT=6 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `adoptionapplications`
--

LOCK TABLES `adoptionapplications` WRITE;
/*!40000 ALTER TABLE `adoptionapplications` DISABLE KEYS */;
INSERT INTO `adoptionapplications` VALUES (1,7,2,83,'rejected','2026-08-11 12:40:47','สนใจรับเลี้ยงน้องแมวตัวนี้ครับ/ค่ะ (ส่งจากแอป)'),(2,9,5,93,'rejected','2026-08-11 12:44:29','สนใจรับเลี้ยงน้องแมวตัวนี้ครับ/ค่ะ (ส่งจากแอป)'),(3,7,5,100,'approved','2026-08-11 13:04:09','สนใจรับเลี้ยงน้องแมวตัวนี้ครับ/ค่ะ (ส่งจากแอป)'),(4,6,4,88,'pending','2026-08-11 15:07:33','สนใจรับเลี้ยงน้องแมวตัวนี้ครับ/ค่ะ (ส่งจากแอป)'),(5,10,6,75,'rejected','2026-08-11 19:18:03','สนใจรับเลี้ยงน้องแมวตัวนี้ครับ/ค่ะ (ส่งจากแอป)');
/*!40000 ALTER TABLE `adoptionapplications` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `assessment_details`
--

DROP TABLE IF EXISTS `assessment_details`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `assessment_details` (
  `detail_id` int NOT NULL AUTO_INCREMENT,
  `assessment_id` int NOT NULL,
  `criteria_id` int NOT NULL,
  `applicant_value` varchar(100) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `required_value` varchar(100) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `weight_used` decimal(5,2) DEFAULT NULL,
  `score_ratio_used` decimal(5,2) DEFAULT NULL,
  `max_score` decimal(5,2) DEFAULT NULL,
  `score_received` decimal(5,2) NOT NULL,
  `stars` decimal(2,1) DEFAULT NULL,
  `passed` tinyint(1) DEFAULT '1',
  `explanation` varchar(255) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  PRIMARY KEY (`detail_id`),
  KEY `fk_detail_assessment` (`assessment_id`),
  KEY `fk_detail_criteria` (`criteria_id`),
  CONSTRAINT `fk_detail_assessment` FOREIGN KEY (`assessment_id`) REFERENCES `assessments` (`assessment_id`) ON DELETE CASCADE ON UPDATE CASCADE,
  CONSTRAINT `fk_detail_criteria` FOREIGN KEY (`criteria_id`) REFERENCES `evaluation_criteria` (`criteria_id`) ON DELETE RESTRICT ON UPDATE CASCADE
) ENGINE=InnoDB AUTO_INCREMENT=423 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `assessment_details`
--

LOCK TABLES `assessment_details` WRITE;
/*!40000 ALTER TABLE `assessment_details` DISABLE KEYS */;
INSERT INTO `assessment_details` VALUES (1,1,1,'large','medium',25.00,1.00,25.00,25.00,5.0,1,'ผลการเปรียบเทียบด้านพื้นที่'),(2,1,4,'5000','3000.00',25.00,1.00,25.00,25.00,5.0,1,'ผลการเปรียบเทียบด้านงบประมาณ'),(3,1,8,'high','low',25.00,1.00,25.00,25.00,5.0,1,'ผลการเปรียบเทียบด้านเวลาการดูแล'),(4,1,11,'experienced','low',25.00,1.00,25.00,25.00,5.0,1,'ผลการเปรียบเทียบด้านประสบการณ์'),(5,2,1,'large','medium',25.00,1.00,25.00,25.00,5.0,1,'ผลการเปรียบเทียบด้านพื้นที่'),(6,2,4,'5000','3000.00',25.00,1.00,25.00,25.00,5.0,1,'ผลการเปรียบเทียบด้านงบประมาณ'),(7,2,8,'high','medium',25.00,1.00,25.00,25.00,5.0,1,'ผลการเปรียบเทียบด้านเวลาการดูแล'),(8,2,11,'experienced','medium',25.00,1.00,25.00,25.00,5.0,1,'ผลการเปรียบเทียบด้านประสบการณ์'),(17,5,1,'large','medium',25.00,1.00,25.00,25.00,5.0,1,'ผลการเปรียบเทียบด้านพื้นที่'),(18,5,4,'5000','3000.00',25.00,1.00,25.00,25.00,5.0,1,'ผลการเปรียบเทียบด้านงบประมาณ'),(19,5,8,'high','low',25.00,1.00,25.00,25.00,5.0,1,'ผลการเปรียบเทียบด้านเวลาการดูแล'),(20,5,11,'experienced','low',25.00,1.00,25.00,25.00,5.0,1,'ผลการเปรียบเทียบด้านประสบการณ์'),(21,6,2,'small','medium',25.00,0.50,25.00,12.50,3.0,1,'ผลการเปรียบเทียบด้านพื้นที่'),(22,6,7,'1000','3000.00',25.00,0.00,25.00,0.00,0.0,0,'ผลการเปรียบเทียบด้านงบประมาณ'),(23,6,8,'low','low',25.00,1.00,25.00,25.00,5.0,1,'ผลการเปรียบเทียบด้านเวลาการดูแล'),(24,7,2,'small','medium',25.00,0.50,25.00,12.50,3.0,1,'ผลการเปรียบเทียบด้านพื้นที่'),(25,7,7,'1000','3000.00',25.00,0.00,25.00,0.00,0.0,0,'ผลการเปรียบเทียบด้านงบประมาณ'),(26,7,8,'low','low',25.00,1.00,25.00,25.00,5.0,1,'ผลการเปรียบเทียบด้านเวลาการดูแล'),(27,8,2,'small','medium',25.00,0.50,25.00,12.50,3.0,1,'ผลการเปรียบเทียบด้านพื้นที่'),(28,8,7,'1000','3000.00',25.00,0.00,25.00,0.00,0.0,0,'ผลการเปรียบเทียบด้านงบประมาณ'),(29,8,8,'low','low',25.00,1.00,25.00,25.00,5.0,1,'ผลการเปรียบเทียบด้านเวลาการดูแล'),(30,8,12,'none','low',25.00,0.50,25.00,12.50,3.0,1,'ผลการเปรียบเทียบด้านประสบการณ์'),(31,9,1,'medium','medium',25.00,1.00,25.00,25.00,5.0,1,'ผลการเปรียบเทียบด้านพื้นที่'),(32,9,7,'0','3000.00',25.00,0.00,25.00,0.00,0.0,0,'ผลการเปรียบเทียบด้านงบประมาณ'),(33,9,8,'medium','low',25.00,1.00,25.00,25.00,5.0,1,'ผลการเปรียบเทียบด้านเวลาการดูแล'),(34,9,11,'beginner','low',25.00,1.00,25.00,25.00,5.0,1,'ผลการเปรียบเทียบด้านประสบการณ์'),(35,10,1,'medium','medium',25.00,1.00,25.00,25.00,5.0,1,'ผลการเปรียบเทียบด้านพื้นที่'),(36,10,7,'0','3000.00',25.00,0.00,25.00,0.00,0.0,0,'ผลการเปรียบเทียบด้านงบประมาณ'),(37,10,8,'medium','medium',25.00,1.00,25.00,25.00,5.0,1,'ผลการเปรียบเทียบด้านเวลาการดูแล'),(38,10,12,'beginner','medium',25.00,0.50,25.00,12.50,3.0,1,'ผลการเปรียบเทียบด้านประสบการณ์'),(43,12,1,'medium','medium',25.00,1.00,25.00,25.00,5.0,1,'ผลการเปรียบเทียบด้านพื้นที่'),(44,12,7,'0','3000.00',25.00,0.00,25.00,0.00,0.0,0,'ผลการเปรียบเทียบด้านงบประมาณ'),(45,12,8,'medium','low',25.00,1.00,25.00,25.00,5.0,1,'ผลการเปรียบเทียบด้านเวลาการดูแล'),(46,12,11,'beginner','low',25.00,1.00,25.00,25.00,5.0,1,'ผลการเปรียบเทียบด้านประสบการณ์'),(47,13,1,'medium','medium',25.00,1.00,25.00,25.00,5.0,1,'ผลการเปรียบเทียบด้านพื้นที่'),(48,13,7,'0','3000.00',25.00,0.00,25.00,0.00,0.0,0,'ผลการเปรียบเทียบด้านงบประมาณ'),(49,13,8,'medium','medium',25.00,1.00,25.00,25.00,5.0,1,'ผลการเปรียบเทียบด้านเวลาการดูแล'),(50,13,12,'beginner','medium',25.00,0.50,25.00,12.50,3.0,1,'ผลการเปรียบเทียบด้านประสบการณ์'),(55,15,1,'medium','medium',25.00,1.00,25.00,25.00,5.0,1,'ผลการเปรียบเทียบด้านพื้นที่'),(56,15,7,'0','3000.00',25.00,0.00,25.00,0.00,0.0,0,'ผลการเปรียบเทียบด้านงบประมาณ'),(57,15,8,'medium','medium',25.00,1.00,25.00,25.00,5.0,1,'ผลการเปรียบเทียบด้านเวลาการดูแล'),(58,15,12,'beginner','medium',25.00,0.50,25.00,12.50,3.0,1,'ผลการเปรียบเทียบด้านประสบการณ์'),(59,16,1,'medium','medium',25.00,1.00,25.00,25.00,5.0,1,'ผลการเปรียบเทียบด้านพื้นที่'),(60,16,4,'3000','3000.00',25.00,1.00,25.00,25.00,5.0,1,'ผลการเปรียบเทียบด้านงบประมาณ'),(61,16,8,'medium','medium',25.00,1.00,25.00,25.00,5.0,1,'ผลการเปรียบเทียบด้านเวลาการดูแล'),(62,16,12,'beginner','medium',25.00,0.50,25.00,12.50,3.0,1,'ผลการเปรียบเทียบด้านประสบการณ์'),(67,18,1,'medium','small',25.00,1.00,25.00,25.00,5.0,1,'ผลการเปรียบเทียบด้านพื้นที่'),(68,18,4,'3000','3000.00',25.00,1.00,25.00,25.00,5.0,1,'ผลการเปรียบเทียบด้านงบประมาณ'),(69,18,9,'medium','high',25.00,0.50,25.00,12.50,3.0,1,'ผลการเปรียบเทียบด้านเวลาการดูแล'),(70,18,13,'beginner','high',25.00,0.00,25.00,0.00,0.0,0,'ผลการเปรียบเทียบด้านประสบการณ์'),(71,19,1,'medium','medium',25.00,1.00,25.00,25.00,5.0,1,'ผลการเปรียบเทียบด้านพื้นที่'),(72,19,4,'3000','3000.00',25.00,1.00,25.00,25.00,5.0,1,'ผลการเปรียบเทียบด้านงบประมาณ'),(73,19,8,'medium','low',25.00,1.00,25.00,25.00,5.0,1,'ผลการเปรียบเทียบด้านเวลาการดูแล'),(74,19,11,'beginner','low',25.00,1.00,25.00,25.00,5.0,1,'ผลการเปรียบเทียบด้านประสบการณ์'),(75,20,1,'medium','medium',25.00,1.00,25.00,25.00,5.0,1,'ผลการเปรียบเทียบด้านพื้นที่'),(76,20,4,'3000','3000.00',25.00,1.00,25.00,25.00,5.0,1,'ผลการเปรียบเทียบด้านงบประมาณ'),(77,20,8,'medium','low',25.00,1.00,25.00,25.00,5.0,1,'ผลการเปรียบเทียบด้านเวลาการดูแล'),(78,20,11,'beginner','low',25.00,1.00,25.00,25.00,5.0,1,'ผลการเปรียบเทียบด้านประสบการณ์'),(83,22,1,'medium','small',25.00,1.00,25.00,25.00,5.0,1,'ผลการเปรียบเทียบด้านพื้นที่'),(84,22,4,'3000','3000.00',25.00,1.00,25.00,25.00,5.0,1,'ผลการเปรียบเทียบด้านงบประมาณ'),(85,22,9,'medium','high',25.00,0.50,25.00,12.50,3.0,1,'ผลการเปรียบเทียบด้านเวลาการดูแล'),(86,22,13,'beginner','high',25.00,0.00,25.00,0.00,0.0,0,'ผลการเปรียบเทียบด้านประสบการณ์'),(91,24,1,'medium','small',25.00,1.00,25.00,25.00,5.0,1,'ผลการเปรียบเทียบด้านพื้นที่'),(92,24,4,'3000','3000.00',25.00,1.00,25.00,25.00,5.0,1,'ผลการเปรียบเทียบด้านงบประมาณ'),(93,24,9,'medium','high',25.00,0.50,25.00,12.50,3.0,1,'ผลการเปรียบเทียบด้านเวลาการดูแล'),(94,24,11,'beginner','low',25.00,1.00,25.00,25.00,5.0,1,'ผลการเปรียบเทียบด้านประสบการณ์'),(99,26,1,'medium','small',25.00,1.00,25.00,25.00,5.0,1,'ผลการเปรียบเทียบด้านพื้นที่'),(100,26,4,'3000','3000.00',25.00,1.00,25.00,25.00,5.0,1,'ผลการเปรียบเทียบด้านงบประมาณ'),(101,26,9,'medium','high',25.00,0.50,25.00,12.50,3.0,1,'ผลการเปรียบเทียบด้านเวลาการดูแล'),(102,26,11,'beginner','low',25.00,1.00,25.00,25.00,5.0,1,'ผลการเปรียบเทียบด้านประสบการณ์'),(103,27,1,'medium','medium',25.00,1.00,25.00,25.00,5.0,1,'ผลการเปรียบเทียบด้านพื้นที่'),(104,27,4,'3000','3000.00',25.00,1.00,25.00,25.00,5.0,1,'ผลการเปรียบเทียบด้านงบประมาณ'),(105,27,8,'medium','low',25.00,1.00,25.00,25.00,5.0,1,'ผลการเปรียบเทียบด้านเวลาการดูแล'),(106,27,11,'beginner','low',25.00,1.00,25.00,25.00,5.0,1,'ผลการเปรียบเทียบด้านประสบการณ์'),(107,28,1,'medium','small',25.00,1.00,25.00,25.00,5.0,1,'ผลการเปรียบเทียบด้านพื้นที่'),(108,28,4,'3000','3000.00',25.00,1.00,25.00,25.00,5.0,1,'ผลการเปรียบเทียบด้านงบประมาณ'),(109,28,9,'medium','high',25.00,0.50,25.00,12.50,3.0,1,'ผลการเปรียบเทียบด้านเวลาการดูแล'),(110,28,13,'beginner','high',25.00,0.00,25.00,0.00,0.0,0,'ผลการเปรียบเทียบด้านประสบการณ์'),(111,29,1,'medium','medium',25.00,1.00,25.00,25.00,5.0,1,'ผลการเปรียบเทียบด้านพื้นที่'),(112,29,4,'3000','3000.00',25.00,1.00,25.00,25.00,5.0,1,'ผลการเปรียบเทียบด้านงบประมาณ'),(113,29,8,'medium','medium',25.00,1.00,25.00,25.00,5.0,1,'ผลการเปรียบเทียบด้านเวลาการดูแล'),(114,29,12,'beginner','medium',25.00,0.50,25.00,12.50,3.0,1,'ผลการเปรียบเทียบด้านประสบการณ์'),(119,31,1,'medium','medium',25.00,1.00,25.00,25.00,5.0,1,'ผลการเปรียบเทียบด้านพื้นที่'),(120,31,4,'3000','3000.00',25.00,1.00,25.00,25.00,5.0,1,'ผลการเปรียบเทียบด้านงบประมาณ'),(121,31,8,'medium','medium',25.00,1.00,25.00,25.00,5.0,1,'ผลการเปรียบเทียบด้านเวลาการดูแล'),(122,31,12,'beginner','medium',25.00,0.50,25.00,12.50,3.0,1,'ผลการเปรียบเทียบด้านประสบการณ์'),(123,32,1,'medium','medium',25.00,1.00,25.00,25.00,5.0,1,'ผลการเปรียบเทียบด้านพื้นที่'),(124,32,4,'3000','3000.00',25.00,1.00,25.00,25.00,5.0,1,'ผลการเปรียบเทียบด้านงบประมาณ'),(125,32,8,'medium','medium',25.00,1.00,25.00,25.00,5.0,1,'ผลการเปรียบเทียบด้านเวลาการดูแล'),(126,32,12,'beginner','medium',25.00,0.50,25.00,12.50,3.0,1,'ผลการเปรียบเทียบด้านประสบการณ์'),(131,34,1,'medium','medium',25.00,1.00,25.00,25.00,5.0,1,'ผลการเปรียบเทียบด้านพื้นที่'),(132,34,4,'3000','3000.00',25.00,1.00,25.00,25.00,5.0,1,'ผลการเปรียบเทียบด้านงบประมาณ'),(133,34,8,'medium','low',25.00,1.00,25.00,25.00,5.0,1,'ผลการเปรียบเทียบด้านเวลาการดูแล'),(134,34,11,'beginner','low',25.00,1.00,25.00,25.00,5.0,1,'ผลการเปรียบเทียบด้านประสบการณ์'),(135,35,1,'medium','small',25.00,1.00,25.00,25.00,5.0,1,'ผลการเปรียบเทียบด้านพื้นที่'),(136,35,4,'3000','3000.00',25.00,1.00,25.00,25.00,5.0,1,'ผลการเปรียบเทียบด้านงบประมาณ'),(137,35,9,'medium','high',25.00,0.50,25.00,12.50,3.0,1,'ผลการเปรียบเทียบด้านเวลาการดูแล'),(138,35,13,'beginner','high',25.00,0.00,25.00,0.00,0.0,0,'ผลการเปรียบเทียบด้านประสบการณ์'),(143,37,1,'medium','medium',25.00,1.00,25.00,25.00,5.0,1,'ผลการเปรียบเทียบด้านพื้นที่'),(144,37,4,'3000','3000.00',25.00,1.00,25.00,25.00,5.0,1,'ผลการเปรียบเทียบด้านงบประมาณ'),(145,37,8,'medium','low',25.00,1.00,25.00,25.00,5.0,1,'ผลการเปรียบเทียบด้านเวลาการดูแล'),(146,37,11,'beginner','low',25.00,1.00,25.00,25.00,5.0,1,'ผลการเปรียบเทียบด้านประสบการณ์'),(147,38,1,'large','medium',25.00,1.00,25.00,25.00,5.0,1,'ผลการเปรียบเทียบด้านพื้นที่'),(148,38,4,'5000','3000.00',25.00,1.00,25.00,25.00,5.0,1,'ผลการเปรียบเทียบด้านงบประมาณ'),(149,38,9,'low','medium',25.00,0.50,25.00,12.50,3.0,1,'ผลการเปรียบเทียบด้านเวลาการดูแล'),(150,38,11,'experienced','medium',25.00,1.00,25.00,25.00,5.0,1,'ผลการเปรียบเทียบด้านประสบการณ์'),(155,40,1,'large','medium',25.00,1.00,25.00,25.00,5.0,1,'ผลการเปรียบเทียบด้านพื้นที่'),(156,40,4,'5000','3000.00',25.00,1.00,25.00,25.00,5.0,1,'ผลการเปรียบเทียบด้านงบประมาณ'),(157,40,8,'low','low',25.00,1.00,25.00,25.00,5.0,1,'ผลการเปรียบเทียบด้านเวลาการดูแล'),(158,40,11,'experienced','low',25.00,1.00,25.00,25.00,5.0,1,'ผลการเปรียบเทียบด้านประสบการณ์'),(159,41,1,'large','small',25.00,1.00,25.00,25.00,5.0,1,'ผลการเปรียบเทียบด้านพื้นที่'),(160,41,4,'5000','3000.00',25.00,1.00,25.00,25.00,5.0,1,'ผลการเปรียบเทียบด้านงบประมาณ'),(161,41,10,'low','high',25.00,0.00,25.00,0.00,0.0,0,'ผลการเปรียบเทียบด้านเวลาการดูแล'),(162,41,11,'experienced','high',25.00,1.00,25.00,25.00,5.0,1,'ผลการเปรียบเทียบด้านประสบการณ์'),(163,42,1,'large','medium',25.00,1.00,25.00,25.00,5.0,1,'ผลการเปรียบเทียบด้านพื้นที่'),(164,42,4,'5000','3000.00',25.00,1.00,25.00,25.00,5.0,1,'ผลการเปรียบเทียบด้านงบประมาณ'),(165,42,9,'low','medium',25.00,0.50,25.00,12.50,3.0,1,'ผลการเปรียบเทียบด้านเวลาการดูแล'),(166,42,11,'experienced','low',25.00,1.00,25.00,25.00,5.0,1,'ผลการเปรียบเทียบด้านประสบการณ์'),(167,43,1,'medium','medium',25.00,1.00,25.00,25.00,5.0,1,'ผลการเปรียบเทียบด้านพื้นที่'),(168,43,6,'2000','3000.00',25.00,0.30,25.00,7.50,2.0,1,'ผลการเปรียบเทียบด้านงบประมาณ'),(169,43,8,'high','low',25.00,1.00,25.00,25.00,5.0,1,'ผลการเปรียบเทียบด้านเวลาการดูแล'),(170,43,11,'experienced','low',25.00,1.00,25.00,25.00,5.0,1,'ผลการเปรียบเทียบด้านประสบการณ์'),(171,44,1,'medium','small',25.00,1.00,25.00,25.00,5.0,1,'ผลการเปรียบเทียบด้านพื้นที่'),(172,44,6,'2000','3000.00',25.00,0.30,25.00,7.50,2.0,1,'ผลการเปรียบเทียบด้านงบประมาณ'),(173,44,8,'high','high',25.00,1.00,25.00,25.00,5.0,1,'ผลการเปรียบเทียบด้านเวลาการดูแล'),(174,44,11,'experienced','high',25.00,1.00,25.00,25.00,5.0,1,'ผลการเปรียบเทียบด้านประสบการณ์'),(175,45,1,'medium','medium',25.00,1.00,25.00,25.00,5.0,1,'ผลการเปรียบเทียบด้านพื้นที่'),(176,45,6,'2000','3000.00',25.00,0.30,25.00,7.50,2.0,1,'ผลการเปรียบเทียบด้านงบประมาณ'),(177,45,8,'high','low',25.00,1.00,25.00,25.00,5.0,1,'ผลการเปรียบเทียบด้านเวลาการดูแล'),(178,45,11,'experienced','low',25.00,1.00,25.00,25.00,5.0,1,'ผลการเปรียบเทียบด้านประสบการณ์'),(179,46,1,'medium','medium',25.00,1.00,25.00,25.00,5.0,1,'ผลการเปรียบเทียบด้านพื้นที่'),(180,46,4,'3000','3000.00',25.00,1.00,25.00,25.00,5.0,1,'ผลการเปรียบเทียบด้านงบประมาณ'),(181,46,8,'medium','low',25.00,1.00,25.00,25.00,5.0,1,'ผลการเปรียบเทียบด้านเวลาการดูแล'),(182,46,11,'beginner','low',25.00,1.00,25.00,25.00,5.0,1,'ผลการเปรียบเทียบด้านประสบการณ์'),(183,47,1,'medium','medium',25.00,1.00,25.00,25.00,5.0,1,'ผลการเปรียบเทียบด้านพื้นที่'),(184,47,4,'3000','3000.00',25.00,1.00,25.00,25.00,5.0,1,'ผลการเปรียบเทียบด้านงบประมาณ'),(185,47,8,'medium','low',25.00,1.00,25.00,25.00,5.0,1,'ผลการเปรียบเทียบด้านเวลาการดูแล'),(186,47,11,'beginner','low',25.00,1.00,25.00,25.00,5.0,1,'ผลการเปรียบเทียบด้านประสบการณ์'),(187,48,1,'medium','medium',25.00,1.00,25.00,25.00,5.0,1,'ผลการเปรียบเทียบด้านพื้นที่'),(188,48,4,'3000','3000.00',25.00,1.00,25.00,25.00,5.0,1,'ผลการเปรียบเทียบด้านงบประมาณ'),(189,48,8,'medium','medium',25.00,1.00,25.00,25.00,5.0,1,'ผลการเปรียบเทียบด้านเวลาการดูแล'),(190,48,12,'beginner','medium',25.00,0.50,25.00,12.50,3.0,1,'ผลการเปรียบเทียบด้านประสบการณ์'),(191,49,1,'medium','medium',25.00,1.00,25.00,25.00,5.0,1,'ผลการเปรียบเทียบด้านพื้นที่'),(192,49,4,'3000','3000.00',25.00,1.00,25.00,25.00,5.0,1,'ผลการเปรียบเทียบด้านงบประมาณ'),(193,49,8,'medium','medium',25.00,1.00,25.00,25.00,5.0,1,'ผลการเปรียบเทียบด้านเวลาการดูแล'),(194,49,12,'beginner','medium',25.00,0.50,25.00,12.50,3.0,1,'ผลการเปรียบเทียบด้านประสบการณ์'),(195,50,1,'medium','medium',25.00,1.00,25.00,25.00,5.0,1,'ผลการเปรียบเทียบด้านพื้นที่'),(196,50,4,'3000','3000.00',25.00,1.00,25.00,25.00,5.0,1,'ผลการเปรียบเทียบด้านงบประมาณ'),(197,50,8,'medium','medium',25.00,1.00,25.00,25.00,5.0,1,'ผลการเปรียบเทียบด้านเวลาการดูแล'),(198,50,12,'beginner','medium',25.00,0.50,25.00,12.50,3.0,1,'ผลการเปรียบเทียบด้านประสบการณ์'),(199,51,1,'medium','medium',25.00,1.00,25.00,25.00,5.0,1,'ผลการเปรียบเทียบด้านพื้นที่'),(200,51,4,'3000','3000.00',25.00,1.00,25.00,25.00,5.0,1,'ผลการเปรียบเทียบด้านงบประมาณ'),(201,51,8,'medium','low',25.00,1.00,25.00,25.00,5.0,1,'ผลการเปรียบเทียบด้านเวลาการดูแล'),(202,51,11,'beginner','low',25.00,1.00,25.00,25.00,5.0,1,'ผลการเปรียบเทียบด้านประสบการณ์'),(203,52,1,'medium','medium',25.00,1.00,25.00,25.00,5.0,1,'ผลการเปรียบเทียบด้านพื้นที่'),(204,52,4,'3000','3000.00',25.00,1.00,25.00,25.00,5.0,1,'ผลการเปรียบเทียบด้านงบประมาณ'),(205,52,8,'medium','medium',25.00,1.00,25.00,25.00,5.0,1,'ผลการเปรียบเทียบด้านเวลาการดูแล'),(206,52,11,'beginner','low',25.00,1.00,25.00,25.00,5.0,1,'ผลการเปรียบเทียบด้านประสบการณ์'),(207,53,1,'medium','medium',25.00,1.00,25.00,25.00,5.0,1,'ผลการเปรียบเทียบด้านพื้นที่'),(208,53,4,'3000','3000.00',25.00,1.00,25.00,25.00,5.0,1,'ผลการเปรียบเทียบด้านงบประมาณ'),(209,53,8,'medium','low',25.00,1.00,25.00,25.00,5.0,1,'ผลการเปรียบเทียบด้านเวลาการดูแล'),(210,53,11,'beginner','low',25.00,1.00,25.00,25.00,5.0,1,'ผลการเปรียบเทียบด้านประสบการณ์'),(211,54,1,'medium','medium',25.00,1.00,25.00,25.00,5.0,1,'ผลการเปรียบเทียบด้านพื้นที่'),(212,54,4,'3000','3000.00',25.00,1.00,25.00,25.00,5.0,1,'ผลการเปรียบเทียบด้านงบประมาณ'),(213,54,8,'medium','low',25.00,1.00,25.00,25.00,5.0,1,'ผลการเปรียบเทียบด้านเวลาการดูแล'),(214,54,11,'beginner','low',25.00,1.00,25.00,25.00,5.0,1,'ผลการเปรียบเทียบด้านประสบการณ์'),(215,55,1,'medium','medium',25.00,1.00,25.00,25.00,5.0,1,'ผลการเปรียบเทียบด้านพื้นที่'),(216,55,4,'3000','3000.00',25.00,1.00,25.00,25.00,5.0,1,'ผลการเปรียบเทียบด้านงบประมาณ'),(217,55,8,'medium','low',25.00,1.00,25.00,25.00,5.0,1,'ผลการเปรียบเทียบด้านเวลาการดูแล'),(218,55,11,'beginner','low',25.00,1.00,25.00,25.00,5.0,1,'ผลการเปรียบเทียบด้านประสบการณ์'),(219,56,1,'medium','small',25.00,1.00,25.00,25.00,5.0,1,'ผลการเปรียบเทียบด้านพื้นที่'),(220,56,4,'3000','3000.00',25.00,1.00,25.00,25.00,5.0,1,'ผลการเปรียบเทียบด้านงบประมาณ'),(221,56,9,'medium','high',25.00,0.50,25.00,12.50,3.0,1,'ผลการเปรียบเทียบด้านเวลาการดูแล'),(222,56,13,'beginner','high',25.00,0.00,25.00,0.00,0.0,0,'ผลการเปรียบเทียบด้านประสบการณ์'),(231,59,1,'medium','small',25.00,1.00,25.00,25.00,5.0,1,'ผลการเปรียบเทียบด้านพื้นที่'),(232,59,6,'2000','3000.00',25.00,0.30,25.00,7.50,2.0,1,'ผลการเปรียบเทียบด้านงบประมาณ'),(233,59,8,'high','high',25.00,1.00,25.00,25.00,5.0,1,'ผลการเปรียบเทียบด้านเวลาการดูแล'),(234,59,11,'experienced','high',25.00,1.00,25.00,25.00,5.0,1,'ผลการเปรียบเทียบด้านประสบการณ์'),(235,60,1,'medium','medium',25.00,1.00,25.00,25.00,5.0,1,'ผลการเปรียบเทียบด้านพื้นที่'),(236,60,6,'2000','3000.00',25.00,0.30,25.00,7.50,2.0,1,'ผลการเปรียบเทียบด้านงบประมาณ'),(237,60,8,'high','medium',25.00,1.00,25.00,25.00,5.0,1,'ผลการเปรียบเทียบด้านเวลาการดูแล'),(238,60,11,'experienced','medium',25.00,1.00,25.00,25.00,5.0,1,'ผลการเปรียบเทียบด้านประสบการณ์'),(239,61,1,'medium','medium',25.00,1.00,25.00,25.00,5.0,1,'ผลการเปรียบเทียบด้านพื้นที่'),(240,61,6,'2000','3000.00',25.00,0.30,25.00,7.50,2.0,1,'ผลการเปรียบเทียบด้านงบประมาณ'),(241,61,8,'high','medium',25.00,1.00,25.00,25.00,5.0,1,'ผลการเปรียบเทียบด้านเวลาการดูแล'),(242,61,11,'experienced','low',25.00,1.00,25.00,25.00,5.0,1,'ผลการเปรียบเทียบด้านประสบการณ์'),(243,62,1,'medium','small',25.00,1.00,25.00,25.00,5.0,1,'ผลการเปรียบเทียบด้านพื้นที่'),(244,62,6,'2000','3000.00',25.00,0.30,25.00,7.50,2.0,1,'ผลการเปรียบเทียบด้านงบประมาณ'),(245,62,8,'high','high',25.00,1.00,25.00,25.00,5.0,1,'ผลการเปรียบเทียบด้านเวลาการดูแล'),(246,62,11,'experienced','high',25.00,1.00,25.00,25.00,5.0,1,'ผลการเปรียบเทียบด้านประสบการณ์'),(247,63,1,'medium','medium',25.00,1.00,25.00,25.00,5.0,1,'ผลการเปรียบเทียบด้านพื้นที่'),(248,63,6,'2000','3000.00',25.00,0.30,25.00,7.50,2.0,1,'ผลการเปรียบเทียบด้านงบประมาณ'),(249,63,8,'high','medium',25.00,1.00,25.00,25.00,5.0,1,'ผลการเปรียบเทียบด้านเวลาการดูแล'),(250,63,11,'experienced','medium',25.00,1.00,25.00,25.00,5.0,1,'ผลการเปรียบเทียบด้านประสบการณ์'),(255,65,1,'medium','small',25.00,1.00,25.00,25.00,5.0,1,'ผลการเปรียบเทียบด้านพื้นที่'),(256,65,6,'2000','3000.00',25.00,0.30,25.00,7.50,2.0,1,'ผลการเปรียบเทียบด้านงบประมาณ'),(257,65,8,'high','high',25.00,1.00,25.00,25.00,5.0,1,'ผลการเปรียบเทียบด้านเวลาการดูแล'),(258,65,11,'experienced','high',25.00,1.00,25.00,25.00,5.0,1,'ผลการเปรียบเทียบด้านประสบการณ์'),(259,66,1,'medium','medium',25.00,1.00,25.00,25.00,5.0,1,'ผลการเปรียบเทียบด้านพื้นที่'),(260,66,6,'2000','3000.00',25.00,0.30,25.00,7.50,2.0,1,'ผลการเปรียบเทียบด้านงบประมาณ'),(261,66,8,'high','medium',25.00,1.00,25.00,25.00,5.0,1,'ผลการเปรียบเทียบด้านเวลาการดูแล'),(262,66,11,'experienced','low',25.00,1.00,25.00,25.00,5.0,1,'ผลการเปรียบเทียบด้านประสบการณ์'),(263,67,1,'medium','small',25.00,1.00,25.00,25.00,5.0,1,'ผลการเปรียบเทียบด้านพื้นที่'),(264,67,6,'2000','3000.00',25.00,0.30,25.00,7.50,2.0,1,'ผลการเปรียบเทียบด้านงบประมาณ'),(265,67,8,'high','high',25.00,1.00,25.00,25.00,5.0,1,'ผลการเปรียบเทียบด้านเวลาการดูแล'),(266,67,11,'experienced','high',25.00,1.00,25.00,25.00,5.0,1,'ผลการเปรียบเทียบด้านประสบการณ์'),(267,68,1,'medium','small',25.00,1.00,25.00,25.00,5.0,1,'ผลการเปรียบเทียบด้านพื้นที่'),(268,68,6,'2000','3000.00',25.00,0.30,25.00,7.50,2.0,1,'ผลการเปรียบเทียบด้านงบประมาณ'),(269,68,8,'high','high',25.00,1.00,25.00,25.00,5.0,1,'ผลการเปรียบเทียบด้านเวลาการดูแล'),(270,68,11,'experienced','high',25.00,1.00,25.00,25.00,5.0,1,'ผลการเปรียบเทียบด้านประสบการณ์'),(271,69,1,'medium','medium',25.00,1.00,25.00,25.00,5.0,1,'ผลการเปรียบเทียบด้านพื้นที่'),(272,69,6,'2000','3000.00',25.00,0.30,25.00,7.50,2.0,1,'ผลการเปรียบเทียบด้านงบประมาณ'),(273,69,9,'low','medium',25.00,0.50,25.00,12.50,3.0,1,'ผลการเปรียบเทียบด้านเวลาการดูแล'),(274,69,11,'experienced','low',25.00,1.00,25.00,25.00,5.0,1,'ผลการเปรียบเทียบด้านประสบการณ์'),(275,70,1,'medium','medium',25.00,1.00,25.00,25.00,5.0,1,'ผลการเปรียบเทียบด้านพื้นที่'),(276,70,6,'2000','3000.00',25.00,0.30,25.00,7.50,2.0,1,'ผลการเปรียบเทียบด้านงบประมาณ'),(277,70,9,'low','medium',25.00,0.50,25.00,12.50,3.0,1,'ผลการเปรียบเทียบด้านเวลาการดูแล'),(278,70,11,'experienced','medium',25.00,1.00,25.00,25.00,5.0,1,'ผลการเปรียบเทียบด้านประสบการณ์'),(283,72,1,'medium','small',25.00,1.00,25.00,25.00,5.0,1,'ผลการเปรียบเทียบด้านพื้นที่'),(284,72,6,'2000','3000.00',25.00,0.30,25.00,7.50,2.0,1,'ผลการเปรียบเทียบด้านงบประมาณ'),(285,72,10,'low','high',25.00,0.00,25.00,0.00,0.0,0,'ผลการเปรียบเทียบด้านเวลาการดูแล'),(286,72,11,'experienced','high',25.00,1.00,25.00,25.00,5.0,1,'ผลการเปรียบเทียบด้านประสบการณ์'),(287,73,1,'medium','small',25.00,1.00,25.00,25.00,5.0,1,'ผลการเปรียบเทียบด้านพื้นที่'),(288,73,6,'2000','3000.00',25.00,0.30,25.00,7.50,2.0,1,'ผลการเปรียบเทียบด้านงบประมาณ'),(289,73,10,'low','high',25.00,0.00,25.00,0.00,0.0,0,'ผลการเปรียบเทียบด้านเวลาการดูแล'),(290,73,11,'experienced','high',25.00,1.00,25.00,25.00,5.0,1,'ผลการเปรียบเทียบด้านประสบการณ์'),(291,74,1,'medium','small',25.00,1.00,25.00,25.00,5.0,1,'ผลการเปรียบเทียบด้านพื้นที่'),(292,74,6,'2000','3000.00',25.00,0.30,25.00,7.50,2.0,1,'ผลการเปรียบเทียบด้านงบประมาณ'),(293,74,9,'medium','high',25.00,0.50,25.00,12.50,3.0,1,'ผลการเปรียบเทียบด้านเวลาการดูแล'),(294,74,11,'experienced','high',25.00,1.00,25.00,25.00,5.0,1,'ผลการเปรียบเทียบด้านประสบการณ์'),(295,75,1,'medium','medium',25.00,1.00,25.00,25.00,5.0,1,'ผลการเปรียบเทียบด้านพื้นที่'),(296,75,6,'2000','3000.00',25.00,0.30,25.00,7.50,2.0,1,'ผลการเปรียบเทียบด้านงบประมาณ'),(297,75,8,'medium','medium',25.00,1.00,25.00,25.00,5.0,1,'ผลการเปรียบเทียบด้านเวลาการดูแล'),(298,75,11,'experienced','medium',25.00,1.00,25.00,25.00,5.0,1,'ผลการเปรียบเทียบด้านประสบการณ์'),(303,77,1,'medium','small',25.00,1.00,25.00,25.00,5.0,1,'ผลการเปรียบเทียบด้านพื้นที่'),(304,77,6,'2000','3000.00',25.00,0.30,25.00,7.50,2.0,1,'ผลการเปรียบเทียบด้านงบประมาณ'),(305,77,9,'medium','high',25.00,0.50,25.00,12.50,3.0,1,'ผลการเปรียบเทียบด้านเวลาการดูแล'),(306,77,11,'experienced','high',25.00,1.00,25.00,25.00,5.0,1,'ผลการเปรียบเทียบด้านประสบการณ์'),(307,78,1,'medium','medium',25.00,1.00,25.00,25.00,5.0,1,'ผลการเปรียบเทียบด้านพื้นที่'),(308,78,6,'2000','3000.00',25.00,0.30,25.00,7.50,2.0,1,'ผลการเปรียบเทียบด้านงบประมาณ'),(309,78,8,'medium','medium',25.00,1.00,25.00,25.00,5.0,1,'ผลการเปรียบเทียบด้านเวลาการดูแล'),(310,78,11,'experienced','low',25.00,1.00,25.00,25.00,5.0,1,'ผลการเปรียบเทียบด้านประสบการณ์'),(311,79,1,'medium','small',25.00,1.00,25.00,25.00,5.0,1,'ผลการเปรียบเทียบด้านพื้นที่'),(312,79,6,'2000','3000.00',25.00,0.30,25.00,7.50,2.0,1,'ผลการเปรียบเทียบด้านงบประมาณ'),(313,79,9,'medium','high',25.00,0.50,25.00,12.50,3.0,1,'ผลการเปรียบเทียบด้านเวลาการดูแล'),(314,79,11,'experienced','high',25.00,1.00,25.00,25.00,5.0,1,'ผลการเปรียบเทียบด้านประสบการณ์'),(319,81,1,'large','small',25.00,1.00,25.00,25.00,5.0,1,'ผลการเปรียบเทียบด้านพื้นที่'),(320,81,6,'2000','3000.00',25.00,0.30,25.00,7.50,2.0,1,'ผลการเปรียบเทียบด้านงบประมาณ'),(321,81,9,'medium','high',25.00,0.50,25.00,12.50,3.0,1,'ผลการเปรียบเทียบด้านเวลาการดูแล'),(322,81,11,'experienced','high',25.00,1.00,25.00,25.00,5.0,1,'ผลการเปรียบเทียบด้านประสบการณ์'),(323,82,1,'medium','small',25.00,1.00,25.00,25.00,5.0,1,'ผลการเปรียบเทียบด้านพื้นที่'),(324,82,4,'5000','3000.00',25.00,1.00,25.00,25.00,5.0,1,'ผลการเปรียบเทียบด้านงบประมาณ'),(325,82,9,'medium','high',25.00,0.50,25.00,12.50,3.0,1,'ผลการเปรียบเทียบด้านเวลาการดูแล'),(326,82,11,'experienced','high',25.00,1.00,25.00,25.00,5.0,1,'ผลการเปรียบเทียบด้านประสบการณ์'),(327,83,1,'medium','small',25.00,1.00,25.00,25.00,5.0,1,'ผลการเปรียบเทียบด้านพื้นที่'),(328,83,4,'5000','3000.00',25.00,1.00,25.00,25.00,5.0,1,'ผลการเปรียบเทียบด้านงบประมาณ'),(329,83,9,'medium','high',25.00,0.50,25.00,12.50,3.0,1,'ผลการเปรียบเทียบด้านเวลาการดูแล'),(330,83,11,'experienced','high',25.00,1.00,25.00,25.00,5.0,1,'ผลการเปรียบเทียบด้านประสบการณ์'),(331,84,1,'medium','medium',25.00,1.00,25.00,25.00,5.0,1,'ผลการเปรียบเทียบด้านพื้นที่'),(332,84,4,'5000','3000.00',25.00,1.00,25.00,25.00,5.0,1,'ผลการเปรียบเทียบด้านงบประมาณ'),(333,84,8,'medium','medium',25.00,1.00,25.00,25.00,5.0,1,'ผลการเปรียบเทียบด้านเวลาการดูแล'),(334,84,11,'experienced','medium',25.00,1.00,25.00,25.00,5.0,1,'ผลการเปรียบเทียบด้านประสบการณ์'),(339,86,1,'medium','small',25.00,1.00,25.00,25.00,5.0,1,'ผลการเปรียบเทียบด้านพื้นที่'),(340,86,4,'5000','3000.00',25.00,1.00,25.00,25.00,5.0,1,'ผลการเปรียบเทียบด้านงบประมาณ'),(341,86,9,'medium','high',25.00,0.50,25.00,12.50,3.0,1,'ผลการเปรียบเทียบด้านเวลาการดูแล'),(342,86,11,'experienced','high',25.00,1.00,25.00,25.00,5.0,1,'ผลการเปรียบเทียบด้านประสบการณ์'),(343,87,1,'medium','medium',25.00,1.00,25.00,25.00,5.0,1,'ผลการเปรียบเทียบด้านพื้นที่'),(344,87,4,'5000','3000.00',25.00,1.00,25.00,25.00,5.0,1,'ผลการเปรียบเทียบด้านงบประมาณ'),(345,87,8,'medium','medium',25.00,1.00,25.00,25.00,5.0,1,'ผลการเปรียบเทียบด้านเวลาการดูแล'),(346,87,11,'experienced','low',25.00,1.00,25.00,25.00,5.0,1,'ผลการเปรียบเทียบด้านประสบการณ์'),(347,88,1,'medium','small',25.00,1.00,25.00,25.00,5.0,1,'ผลการเปรียบเทียบด้านพื้นที่'),(348,88,4,'5000','3000.00',25.00,1.00,25.00,25.00,5.0,1,'ผลการเปรียบเทียบด้านงบประมาณ'),(349,88,9,'medium','high',25.00,0.50,25.00,12.50,3.0,1,'ผลการเปรียบเทียบด้านเวลาการดูแล'),(350,88,11,'experienced','high',25.00,1.00,25.00,25.00,5.0,1,'ผลการเปรียบเทียบด้านประสบการณ์'),(355,90,1,'medium','medium',25.00,1.00,25.00,25.00,5.0,1,'ผลการเปรียบเทียบด้านพื้นที่'),(356,90,4,'3000','3000.00',25.00,1.00,25.00,25.00,5.0,1,'ผลการเปรียบเทียบด้านงบประมาณ'),(357,90,8,'medium','medium',25.00,1.00,25.00,25.00,5.0,1,'ผลการเปรียบเทียบด้านเวลาการดูแล'),(358,90,12,'beginner','medium',25.00,0.50,25.00,12.50,3.0,1,'ผลการเปรียบเทียบด้านประสบการณ์'),(359,91,1,'medium','medium',25.00,1.00,25.00,25.00,5.0,1,'ผลการเปรียบเทียบด้านพื้นที่'),(360,91,4,'3000','3000.00',25.00,1.00,25.00,25.00,5.0,1,'ผลการเปรียบเทียบด้านงบประมาณ'),(361,91,8,'medium','medium',25.00,1.00,25.00,25.00,5.0,1,'ผลการเปรียบเทียบด้านเวลาการดูแล'),(362,91,12,'beginner','medium',25.00,0.50,25.00,12.50,3.0,1,'ผลการเปรียบเทียบด้านประสบการณ์'),(363,92,1,'medium','medium',25.00,1.00,25.00,25.00,5.0,1,'ผลการเปรียบเทียบด้านพื้นที่'),(364,92,4,'3000','3000.00',25.00,1.00,25.00,25.00,5.0,1,'ผลการเปรียบเทียบด้านงบประมาณ'),(365,92,8,'medium','medium',25.00,1.00,25.00,25.00,5.0,1,'ผลการเปรียบเทียบด้านเวลาการดูแล'),(366,92,12,'beginner','medium',25.00,0.50,25.00,12.50,3.0,1,'ผลการเปรียบเทียบด้านประสบการณ์'),(367,93,1,'medium','medium',25.00,1.00,25.00,25.00,5.0,1,'ผลการเปรียบเทียบด้านพื้นที่'),(368,93,4,'3000','3000.00',25.00,1.00,25.00,25.00,5.0,1,'ผลการเปรียบเทียบด้านงบประมาณ'),(369,93,8,'medium','medium',25.00,1.00,25.00,25.00,5.0,1,'ผลการเปรียบเทียบด้านเวลาการดูแล'),(370,93,12,'beginner','medium',25.00,0.50,25.00,12.50,3.0,1,'ผลการเปรียบเทียบด้านประสบการณ์'),(371,94,1,'large','small',25.00,1.00,25.00,25.00,5.0,1,'ผลการเปรียบเทียบด้านพื้นที่'),(372,94,4,'3500','3000.00',25.00,1.00,25.00,25.00,5.0,1,'ผลการเปรียบเทียบด้านงบประมาณ'),(373,94,9,'medium','high',25.00,0.50,25.00,12.50,3.0,1,'ผลการเปรียบเทียบด้านเวลาการดูแล'),(374,94,11,'experienced','high',25.00,1.00,25.00,25.00,5.0,1,'ผลการเปรียบเทียบด้านประสบการณ์'),(375,95,1,'large','small',25.00,1.00,25.00,25.00,5.0,1,'ผลการเปรียบเทียบด้านพื้นที่'),(376,95,4,'3500','3000.00',25.00,1.00,25.00,25.00,5.0,1,'ผลการเปรียบเทียบด้านงบประมาณ'),(377,95,9,'medium','high',25.00,0.50,25.00,12.50,3.0,1,'ผลการเปรียบเทียบด้านเวลาการดูแล'),(378,95,11,'experienced','low',25.00,1.00,25.00,25.00,5.0,1,'ผลการเปรียบเทียบด้านประสบการณ์'),(379,96,1,'large','small',25.00,1.00,25.00,25.00,5.0,1,'ผลการเปรียบเทียบด้านพื้นที่'),(380,96,4,'3500','3000.00',25.00,1.00,25.00,25.00,5.0,1,'ผลการเปรียบเทียบด้านงบประมาณ'),(381,96,9,'medium','high',25.00,0.50,25.00,12.50,3.0,1,'ผลการเปรียบเทียบด้านเวลาการดูแล'),(382,96,11,'experienced','high',25.00,1.00,25.00,25.00,5.0,1,'ผลการเปรียบเทียบด้านประสบการณ์'),(383,97,1,'large','medium',25.00,1.00,25.00,25.00,5.0,1,'ผลการเปรียบเทียบด้านพื้นที่'),(384,97,4,'3500','3000.00',25.00,1.00,25.00,25.00,5.0,1,'ผลการเปรียบเทียบด้านงบประมาณ'),(385,97,8,'medium','medium',25.00,1.00,25.00,25.00,5.0,1,'ผลการเปรียบเทียบด้านเวลาการดูแล'),(386,97,11,'experienced','low',25.00,1.00,25.00,25.00,5.0,1,'ผลการเปรียบเทียบด้านประสบการณ์'),(387,98,1,'medium','medium',25.00,1.00,25.00,25.00,5.0,1,'ผลการเปรียบเทียบด้านพื้นที่'),(388,98,4,'5000','3000.00',25.00,1.00,25.00,25.00,5.0,1,'ผลการเปรียบเทียบด้านงบประมาณ'),(389,98,9,'medium','high',25.00,0.50,25.00,12.50,3.0,1,'ผลการเปรียบเทียบด้านเวลาการดูแล'),(390,98,12,'beginner','medium',25.00,0.50,25.00,12.50,3.0,1,'ผลการเปรียบเทียบด้านประสบการณ์'),(391,99,1,'large','small',25.00,1.00,25.00,25.00,5.0,1,'ผลการเปรียบเทียบด้านพื้นที่'),(392,99,4,'3500','3000.00',25.00,1.00,25.00,25.00,5.0,1,'ผลการเปรียบเทียบด้านงบประมาณ'),(393,99,9,'medium','high',25.00,0.50,25.00,12.50,3.0,1,'ผลการเปรียบเทียบด้านเวลาการดูแล'),(394,99,11,'experienced','high',25.00,1.00,25.00,25.00,5.0,1,'ผลการเปรียบเทียบด้านประสบการณ์'),(395,100,1,'large','large',25.00,1.00,25.00,25.00,5.0,1,'ผลการเปรียบเทียบด้านพื้นที่'),(396,100,4,'3500','3000.00',25.00,1.00,25.00,25.00,5.0,1,'ผลการเปรียบเทียบด้านงบประมาณ'),(397,100,8,'medium','medium',25.00,1.00,25.00,25.00,5.0,1,'ผลการเปรียบเทียบด้านเวลาการดูแล'),(398,100,11,'experienced','medium',25.00,1.00,25.00,25.00,5.0,1,'ผลการเปรียบเทียบด้านประสบการณ์'),(399,101,1,'large','medium',25.00,1.00,25.00,25.00,5.0,1,'ผลการเปรียบเทียบด้านพื้นที่'),(400,101,4,'3500','3000.00',25.00,1.00,25.00,25.00,5.0,1,'ผลการเปรียบเทียบด้านงบประมาณ'),(401,101,8,'medium','medium',25.00,1.00,25.00,25.00,5.0,1,'ผลการเปรียบเทียบด้านเวลาการดูแล'),(402,101,11,'experienced','low',25.00,1.00,25.00,25.00,5.0,1,'ผลการเปรียบเทียบด้านประสบการณ์'),(403,102,1,'large','small',25.00,1.00,25.00,25.00,5.0,1,'ผลการเปรียบเทียบด้านพื้นที่'),(404,102,4,'3500','3000.00',25.00,1.00,25.00,25.00,5.0,1,'ผลการเปรียบเทียบด้านงบประมาณ'),(405,102,9,'medium','high',25.00,0.50,25.00,12.50,3.0,1,'ผลการเปรียบเทียบด้านเวลาการดูแล'),(406,102,11,'experienced','high',25.00,1.00,25.00,25.00,5.0,1,'ผลการเปรียบเทียบด้านประสบการณ์'),(407,103,1,'large','medium',25.00,1.00,25.00,25.00,5.0,1,'ผลการเปรียบเทียบด้านพื้นที่'),(408,103,4,'3500','3000.00',25.00,1.00,25.00,25.00,5.0,1,'ผลการเปรียบเทียบด้านงบประมาณ'),(409,103,8,'medium','low',25.00,1.00,25.00,25.00,5.0,1,'ผลการเปรียบเทียบด้านเวลาการดูแล'),(410,103,11,'experienced','low',25.00,1.00,25.00,25.00,5.0,1,'ผลการเปรียบเทียบด้านประสบการณ์'),(411,104,1,'large','small',25.00,1.00,25.00,25.00,5.0,1,'ผลการเปรียบเทียบด้านพื้นที่'),(412,104,4,'3500','3000.00',25.00,1.00,25.00,25.00,5.0,1,'ผลการเปรียบเทียบด้านงบประมาณ'),(413,104,9,'medium','high',25.00,0.50,25.00,12.50,3.0,1,'ผลการเปรียบเทียบด้านเวลาการดูแล'),(414,104,11,'experienced','low',25.00,1.00,25.00,25.00,5.0,1,'ผลการเปรียบเทียบด้านประสบการณ์'),(415,105,2,'medium','large',25.00,0.50,25.00,12.50,3.0,1,'ผลการเปรียบเทียบด้านพื้นที่'),(416,105,4,'3500','3000.00',25.00,1.00,25.00,25.00,5.0,1,'ผลการเปรียบเทียบด้านงบประมาณ'),(417,105,8,'medium','medium',25.00,1.00,25.00,25.00,5.0,1,'ผลการเปรียบเทียบด้านเวลาการดูแล'),(418,105,11,'experienced','medium',25.00,1.00,25.00,25.00,5.0,1,'ผลการเปรียบเทียบด้านประสบการณ์'),(419,106,1,'medium','medium',25.00,1.00,25.00,25.00,5.0,1,'ผลการเปรียบเทียบด้านพื้นที่'),(420,106,4,'3500','3000.00',25.00,1.00,25.00,25.00,5.0,1,'ผลการเปรียบเทียบด้านงบประมาณ'),(421,106,8,'medium','low',25.00,1.00,25.00,25.00,5.0,1,'ผลการเปรียบเทียบด้านเวลาการดูแล'),(422,106,11,'experienced','low',25.00,1.00,25.00,25.00,5.0,1,'ผลการเปรียบเทียบด้านประสบการณ์');
/*!40000 ALTER TABLE `assessment_details` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `assessments`
--

DROP TABLE IF EXISTS `assessments`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `assessments` (
  `assessment_id` int NOT NULL AUTO_INCREMENT,
  `applicant_id` int NOT NULL,
  `cat_id` int NOT NULL,
  `total_score` decimal(5,2) NOT NULL,
  `match_percentage` decimal(5,2) DEFAULT NULL,
  `suitability_level` enum('highly_suitable','suitable','consider','not_suitable') COLLATE utf8mb4_unicode_ci NOT NULL,
  `eligible` tinyint(1) DEFAULT '1',
  `criteria_version` varchar(50) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `recommendation` text COLLATE utf8mb4_unicode_ci,
  `assessed_at` datetime DEFAULT CURRENT_TIMESTAMP,
  PRIMARY KEY (`assessment_id`),
  KEY `fk_assessment_applicant` (`applicant_id`),
  KEY `fk_assessment_cat` (`cat_id`),
  CONSTRAINT `fk_assessment_applicant` FOREIGN KEY (`applicant_id`) REFERENCES `users` (`user_id`) ON DELETE CASCADE ON UPDATE CASCADE,
  CONSTRAINT `fk_assessment_cat` FOREIGN KEY (`cat_id`) REFERENCES `cats` (`cat_id`) ON DELETE CASCADE ON UPDATE CASCADE
) ENGINE=InnoDB AUTO_INCREMENT=107 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `assessments`
--

LOCK TABLES `assessments` WRITE;
/*!40000 ALTER TABLE `assessments` DISABLE KEYS */;
INSERT INTO `assessments` VALUES (1,5,3,100.00,100.00,'highly_suitable',1,NULL,'พื้นที่ของผู้รับเลี้ยงเพียงพอต่อความต้องการของแมว | งบประมาณครอบคลุมค่าใช้จ่ายรายเดือนของแมว | ผู้รับเลี้ยงมีเวลาดูแลเพียงพอ | ผู้รับเลี้ยงมีประสบการณ์เหมาะสม','2026-08-11 12:02:45'),(2,5,9,100.00,100.00,'highly_suitable',1,NULL,'พื้นที่ของผู้รับเลี้ยงเพียงพอต่อความต้องการของแมว | งบประมาณครอบคลุมค่าใช้จ่ายรายเดือนของแมว | ผู้รับเลี้ยงมีเวลาดูแลเพียงพอ | ผู้รับเลี้ยงมีประสบการณ์เหมาะสม','2026-08-11 12:06:25'),(5,5,3,100.00,100.00,'highly_suitable',1,NULL,'พื้นที่ของผู้รับเลี้ยงเพียงพอต่อความต้องการของแมว | งบประมาณครอบคลุมค่าใช้จ่ายรายเดือนของแมว | ผู้รับเลี้ยงมีเวลาดูแลเพียงพอ | ผู้รับเลี้ยงมีประสบการณ์เหมาะสม','2026-08-11 12:07:09'),(6,5,3,37.50,50.00,'consider',0,NULL,'ผู้รับเลี้ยงมีเวลาดูแลเพียงพอ | พื้นที่ต่ำกว่าที่แมวต้องการเล็กน้อย | งบประมาณต่ำกว่าค่าใช้จ่ายที่แมวต้องการมาก | ข้อมูลประสบการณ์ของแมวหรือผู้รับเลี้ยงไม่สมบูรณ์ | งบประมาณต่ำกว่า 60% ของค่าใช้จ่ายโดยประมาณ','2026-08-11 12:08:33'),(7,5,3,37.50,50.00,'consider',0,NULL,'ผู้รับเลี้ยงมีเวลาดูแลเพียงพอ | พื้นที่ต่ำกว่าที่แมวต้องการเล็กน้อย | งบประมาณต่ำกว่าค่าใช้จ่ายที่แมวต้องการมาก | ข้อมูลประสบการณ์ของแมวหรือผู้รับเลี้ยงไม่สมบูรณ์ | งบประมาณต่ำกว่า 60% ของค่าใช้จ่ายโดยประมาณ','2026-08-11 12:09:37'),(8,5,3,50.00,50.00,'consider',0,NULL,'ผู้รับเลี้ยงมีเวลาดูแลเพียงพอ | พื้นที่ต่ำกว่าที่แมวต้องการเล็กน้อย | งบประมาณต่ำกว่าค่าใช้จ่ายที่แมวต้องการมาก | ประสบการณ์ต่ำกว่าที่แนะนำเล็กน้อย | งบประมาณต่ำกว่า 60% ของค่าใช้จ่ายโดยประมาณ','2026-08-11 12:11:47'),(9,5,3,75.00,75.00,'suitable',0,NULL,'พื้นที่ของผู้รับเลี้ยงเพียงพอต่อความต้องการของแมว | ผู้รับเลี้ยงมีเวลาดูแลเพียงพอ | ผู้รับเลี้ยงมีประสบการณ์เหมาะสม | งบประมาณต่ำกว่าค่าใช้จ่ายที่แมวต้องการมาก | แมวตัวนี้ไม่เหมาะกับบ้านที่มีแมวตัวอื่น | งบประมาณต่ำกว่า 60% ของค่าใช้จ่ายโดยประมาณ','2026-08-11 12:13:29'),(10,5,9,62.50,62.50,'suitable',0,NULL,'พื้นที่ของผู้รับเลี้ยงเพียงพอต่อความต้องการของแมว | ผู้รับเลี้ยงมีเวลาดูแลเพียงพอ | งบประมาณต่ำกว่าค่าใช้จ่ายที่แมวต้องการมาก | ประสบการณ์ต่ำกว่าที่แนะนำเล็กน้อย | แมวตัวนี้ไม่เหมาะกับบ้านที่มีเด็กเล็ก | งบประมาณต่ำกว่า 60% ของค่าใช้จ่ายโดยประมาณ','2026-08-11 12:13:43'),(12,5,7,75.00,75.00,'suitable',0,NULL,'พื้นที่ของผู้รับเลี้ยงเพียงพอต่อความต้องการของแมว | ผู้รับเลี้ยงมีเวลาดูแลเพียงพอ | ผู้รับเลี้ยงมีประสบการณ์เหมาะสม | งบประมาณต่ำกว่าค่าใช้จ่ายที่แมวต้องการมาก | งบประมาณต่ำกว่า 60% ของค่าใช้จ่ายโดยประมาณ','2026-08-11 12:14:10'),(13,5,9,62.50,62.50,'suitable',0,NULL,'พื้นที่ของผู้รับเลี้ยงเพียงพอต่อความต้องการของแมว | ผู้รับเลี้ยงมีเวลาดูแลเพียงพอ | งบประมาณต่ำกว่าค่าใช้จ่ายที่แมวต้องการมาก | ประสบการณ์ต่ำกว่าที่แนะนำเล็กน้อย | งบประมาณต่ำกว่า 60% ของค่าใช้จ่ายโดยประมาณ','2026-08-11 12:14:40'),(15,5,9,62.50,62.50,'suitable',0,NULL,'พื้นที่ของผู้รับเลี้ยงเพียงพอต่อความต้องการของแมว | ผู้รับเลี้ยงมีเวลาดูแลเพียงพอ | งบประมาณต่ำกว่าค่าใช้จ่ายที่แมวต้องการมาก | ประสบการณ์ต่ำกว่าที่แนะนำเล็กน้อย | งบประมาณต่ำกว่า 60% ของค่าใช้จ่ายโดยประมาณ','2026-08-11 12:17:45'),(16,5,9,87.50,87.50,'highly_suitable',1,NULL,'พื้นที่ของผู้รับเลี้ยงเพียงพอต่อความต้องการของแมว | งบประมาณครอบคลุมค่าใช้จ่ายรายเดือนของแมว | ผู้รับเลี้ยงมีเวลาดูแลเพียงพอ | ประสบการณ์ต่ำกว่าที่แนะนำเล็กน้อย','2026-08-11 12:18:16'),(18,5,4,62.50,62.50,'suitable',0,NULL,'พื้นที่ของผู้รับเลี้ยงเพียงพอต่อความต้องการของแมว | งบประมาณครอบคลุมค่าใช้จ่ายรายเดือนของแมว | เวลาดูแลต่ำกว่าที่แมวต้องการเล็กน้อย | ประสบการณ์ต่ำกว่าที่แมวต้องการมาก | แมวตัวนี้ไม่เหมาะกับบ้านที่มีแมวตัวอื่น','2026-08-11 12:18:47'),(19,5,3,100.00,100.00,'highly_suitable',0,NULL,'พื้นที่ของผู้รับเลี้ยงเพียงพอต่อความต้องการของแมว | งบประมาณครอบคลุมค่าใช้จ่ายรายเดือนของแมว | ผู้รับเลี้ยงมีเวลาดูแลเพียงพอ | ผู้รับเลี้ยงมีประสบการณ์เหมาะสม | แมวตัวนี้ไม่เหมาะกับบ้านที่มีแมวตัวอื่น','2026-08-11 12:18:54'),(20,5,7,100.00,100.00,'highly_suitable',1,NULL,'พื้นที่ของผู้รับเลี้ยงเพียงพอต่อความต้องการของแมว | งบประมาณครอบคลุมค่าใช้จ่ายรายเดือนของแมว | ผู้รับเลี้ยงมีเวลาดูแลเพียงพอ | ผู้รับเลี้ยงมีประสบการณ์เหมาะสม','2026-08-11 12:19:02'),(22,5,6,62.50,62.50,'suitable',0,NULL,'พื้นที่ของผู้รับเลี้ยงเพียงพอต่อความต้องการของแมว | งบประมาณครอบคลุมค่าใช้จ่ายรายเดือนของแมว | เวลาดูแลต่ำกว่าที่แมวต้องการเล็กน้อย | ประสบการณ์ต่ำกว่าที่แมวต้องการมาก | แมวตัวนี้ไม่เหมาะกับบ้านที่มีแมวตัวอื่น','2026-08-11 12:19:25'),(24,5,1,87.50,87.50,'highly_suitable',1,NULL,'พื้นที่ของผู้รับเลี้ยงเพียงพอต่อความต้องการของแมว | งบประมาณครอบคลุมค่าใช้จ่ายรายเดือนของแมว | ผู้รับเลี้ยงมีประสบการณ์เหมาะสม | เวลาดูแลต่ำกว่าที่แมวต้องการเล็กน้อย','2026-08-11 12:19:44'),(26,5,1,87.50,87.50,'highly_suitable',1,NULL,'พื้นที่ของผู้รับเลี้ยงเพียงพอต่อความต้องการของแมว | งบประมาณครอบคลุมค่าใช้จ่ายรายเดือนของแมว | ผู้รับเลี้ยงมีประสบการณ์เหมาะสม | เวลาดูแลต่ำกว่าที่แมวต้องการเล็กน้อย','2026-08-11 12:20:18'),(27,5,3,100.00,100.00,'highly_suitable',1,NULL,'พื้นที่ของผู้รับเลี้ยงเพียงพอต่อความต้องการของแมว | งบประมาณครอบคลุมค่าใช้จ่ายรายเดือนของแมว | ผู้รับเลี้ยงมีเวลาดูแลเพียงพอ | ผู้รับเลี้ยงมีประสบการณ์เหมาะสม','2026-08-11 12:20:25'),(28,5,6,62.50,62.50,'suitable',0,NULL,'พื้นที่ของผู้รับเลี้ยงเพียงพอต่อความต้องการของแมว | งบประมาณครอบคลุมค่าใช้จ่ายรายเดือนของแมว | เวลาดูแลต่ำกว่าที่แมวต้องการเล็กน้อย | ประสบการณ์ต่ำกว่าที่แมวต้องการมาก | แมวตัวนี้ไม่เหมาะกับบ้านที่มีเด็กเล็ก','2026-08-11 12:20:33'),(29,5,9,87.50,87.50,'highly_suitable',0,NULL,'พื้นที่ของผู้รับเลี้ยงเพียงพอต่อความต้องการของแมว | งบประมาณครอบคลุมค่าใช้จ่ายรายเดือนของแมว | ผู้รับเลี้ยงมีเวลาดูแลเพียงพอ | ประสบการณ์ต่ำกว่าที่แนะนำเล็กน้อย | แมวตัวนี้ไม่เหมาะกับบ้านที่มีเด็กเล็ก','2026-08-11 12:20:39'),(31,5,9,87.50,87.50,'highly_suitable',0,NULL,'พื้นที่ของผู้รับเลี้ยงเพียงพอต่อความต้องการของแมว | งบประมาณครอบคลุมค่าใช้จ่ายรายเดือนของแมว | ผู้รับเลี้ยงมีเวลาดูแลเพียงพอ | ประสบการณ์ต่ำกว่าที่แนะนำเล็กน้อย | แมวตัวนี้ไม่เหมาะกับบ้านที่มีเด็กเล็ก','2026-08-11 12:28:09'),(32,5,9,92.50,92.50,'highly_suitable',1,NULL,'แมวสามารถเข้ากับแมวตัวอื่นได้ดี | พื้นที่ของผู้รับเลี้ยงเพียงพอต่อความต้องการของแมว | งบประมาณครอบคลุมค่าใช้จ่ายรายเดือนของแมว | ผู้รับเลี้ยงมีเวลาดูแลเพียงพอ | แมวตัวนี้ไม่เคยเลี้ยงกับเด็กหรืออาจไม่เหมาะกับเด็กเล็ก | ประสบการณ์ต่ำกว่าที่แนะนำเล็กน้อย','2026-08-11 12:33:50'),(34,5,7,100.00,100.00,'highly_suitable',1,NULL,'แมวสามารถเข้ากับเด็กได้ดี | แมวสามารถเข้ากับแมวตัวอื่นได้ดี | พื้นที่ของผู้รับเลี้ยงเพียงพอต่อความต้องการของแมว | งบประมาณครอบคลุมค่าใช้จ่ายรายเดือนของแมว | ผู้รับเลี้ยงมีเวลาดูแลเพียงพอ | ผู้รับเลี้ยงมีประสบการณ์เหมาะสม','2026-08-11 12:34:08'),(35,5,6,62.50,62.50,'suitable',1,NULL,'พื้นที่ของผู้รับเลี้ยงเพียงพอต่อความต้องการของแมว | งบประมาณครอบคลุมค่าใช้จ่ายรายเดือนของแมว | แมวตัวนี้ไม่เคยเลี้ยงกับเด็กหรืออาจไม่เหมาะกับเด็กเล็ก | แมวตัวนี้ไม่เคยเลี้ยงรวมกับแมวอื่น | เวลาดูแลต่ำกว่าที่แมวต้องการเล็กน้อย | ประสบการณ์ต่ำกว่าที่แมวต้องการมาก','2026-08-11 12:34:15'),(37,5,3,100.00,100.00,'highly_suitable',1,NULL,'แมวสามารถเข้ากับเด็กได้ดี | พื้นที่ของผู้รับเลี้ยงเพียงพอต่อความต้องการของแมว | งบประมาณครอบคลุมค่าใช้จ่ายรายเดือนของแมว | ผู้รับเลี้ยงมีเวลาดูแลเพียงพอ | ผู้รับเลี้ยงมีประสบการณ์เหมาะสม | แมวตัวนี้ไม่เคยเลี้ยงรวมกับแมวอื่น','2026-08-11 12:35:06'),(38,2,9,92.50,92.50,'highly_suitable',1,NULL,'แมวสามารถเข้ากับแมวตัวอื่นได้ดี | พื้นที่ของผู้รับเลี้ยงเพียงพอต่อความต้องการของแมว | งบประมาณครอบคลุมค่าใช้จ่ายรายเดือนของแมว | ผู้รับเลี้ยงมีประสบการณ์เหมาะสม | แมวตัวนี้ไม่เคยเลี้ยงกับเด็กหรืออาจไม่เหมาะกับเด็กเล็ก | เวลาดูแลต่ำกว่าที่แมวต้องการเล็กน้อย','2026-08-11 12:38:03'),(40,2,7,100.00,100.00,'highly_suitable',1,NULL,'แมวสามารถเข้ากับเด็กได้ดี | แมวสามารถเข้ากับแมวตัวอื่นได้ดี | พื้นที่ของผู้รับเลี้ยงเพียงพอต่อความต้องการของแมว | งบประมาณครอบคลุมค่าใช้จ่ายรายเดือนของแมว | ผู้รับเลี้ยงมีเวลาดูแลเพียงพอ | ผู้รับเลี้ยงมีประสบการณ์เหมาะสม','2026-08-11 12:38:42'),(41,2,4,75.00,75.00,'suitable',0,NULL,'พื้นที่ของผู้รับเลี้ยงเพียงพอต่อความต้องการของแมว | งบประมาณครอบคลุมค่าใช้จ่ายรายเดือนของแมว | ผู้รับเลี้ยงมีประสบการณ์เหมาะสม | แมวตัวนี้ไม่เคยเลี้ยงกับเด็กหรืออาจไม่เหมาะกับเด็กเล็ก | เวลาดูแลต่ำกว่าที่แมวต้องการมาก | แมวตัวนี้ต้องการเลี้ยงเดี่ยว ไม่เหมาะกับบ้านที่มีแมว | ไม่มีเวลาดูแลเพียงพอ','2026-08-11 12:38:55'),(42,2,5,97.50,97.50,'highly_suitable',1,NULL,'แมวสามารถเข้ากับเด็กได้ดี | แมวสามารถเข้ากับแมวตัวอื่นได้ดี | พื้นที่ของผู้รับเลี้ยงเพียงพอต่อความต้องการของแมว | งบประมาณครอบคลุมค่าใช้จ่ายรายเดือนของแมว | ผู้รับเลี้ยงมีประสบการณ์เหมาะสม | เวลาดูแลต่ำกว่าที่แมวต้องการเล็กน้อย','2026-08-11 12:39:11'),(43,2,7,82.50,82.50,'highly_suitable',1,NULL,'พื้นที่ของผู้รับเลี้ยงเพียงพอต่อความต้องการของแมว | ผู้รับเลี้ยงมีเวลาดูแลเพียงพอ | ผู้รับเลี้ยงมีประสบการณ์เหมาะสม | งบประมาณอาจไม่เพียงพอต่อค่าใช้จ่าย','2026-08-11 12:39:56'),(44,2,4,82.50,82.50,'highly_suitable',1,NULL,'พื้นที่ของผู้รับเลี้ยงเพียงพอต่อความต้องการของแมว | ผู้รับเลี้ยงมีเวลาดูแลเพียงพอ | ผู้รับเลี้ยงมีประสบการณ์เหมาะสม | งบประมาณอาจไม่เพียงพอต่อค่าใช้จ่าย','2026-08-11 12:40:11'),(45,2,7,82.50,82.50,'highly_suitable',1,NULL,'พื้นที่ของผู้รับเลี้ยงเพียงพอต่อความต้องการของแมว | ผู้รับเลี้ยงมีเวลาดูแลเพียงพอ | ผู้รับเลี้ยงมีประสบการณ์เหมาะสม | งบประมาณอาจไม่เพียงพอต่อค่าใช้จ่าย','2026-08-11 12:40:45'),(46,5,7,100.00,100.00,'highly_suitable',1,NULL,'แมวสามารถเข้ากับเด็กได้ดี | แมวสามารถเข้ากับแมวตัวอื่นได้ดี | พื้นที่ของผู้รับเลี้ยงเพียงพอต่อความต้องการของแมว | งบประมาณครอบคลุมค่าใช้จ่ายรายเดือนของแมว | ผู้รับเลี้ยงมีเวลาดูแลเพียงพอ | ผู้รับเลี้ยงมีประสบการณ์เหมาะสม','2026-08-11 12:41:59'),(47,5,7,100.00,100.00,'highly_suitable',1,NULL,'แมวสามารถเข้ากับเด็กได้ดี | แมวสามารถเข้ากับแมวตัวอื่นได้ดี | พื้นที่ของผู้รับเลี้ยงเพียงพอต่อความต้องการของแมว | งบประมาณครอบคลุมค่าใช้จ่ายรายเดือนของแมว | ผู้รับเลี้ยงมีเวลาดูแลเพียงพอ | ผู้รับเลี้ยงมีประสบการณ์เหมาะสม','2026-08-11 12:42:17'),(48,5,9,92.50,92.50,'highly_suitable',1,NULL,'แมวสามารถเข้ากับแมวตัวอื่นได้ดี | พื้นที่ของผู้รับเลี้ยงเพียงพอต่อความต้องการของแมว | งบประมาณครอบคลุมค่าใช้จ่ายรายเดือนของแมว | ผู้รับเลี้ยงมีเวลาดูแลเพียงพอ | แมวตัวนี้ไม่เคยเลี้ยงกับเด็กหรืออาจไม่เหมาะกับเด็กเล็ก | ประสบการณ์ต่ำกว่าที่แนะนำเล็กน้อย','2026-08-11 12:44:28'),(49,5,9,92.50,92.50,'highly_suitable',1,NULL,'แมวสามารถเข้ากับแมวตัวอื่นได้ดี | พื้นที่ของผู้รับเลี้ยงเพียงพอต่อความต้องการของแมว | งบประมาณครอบคลุมค่าใช้จ่ายรายเดือนของแมว | ผู้รับเลี้ยงมีเวลาดูแลเพียงพอ | แมวตัวนี้ไม่เคยเลี้ยงกับเด็กหรืออาจไม่เหมาะกับเด็กเล็ก | ประสบการณ์ต่ำกว่าที่แนะนำเล็กน้อย','2026-08-11 12:45:13'),(50,5,9,92.50,92.50,'highly_suitable',1,NULL,'แมวสามารถเข้ากับแมวตัวอื่นได้ดี | พื้นที่ของผู้รับเลี้ยงเพียงพอต่อความต้องการของแมว | งบประมาณครอบคลุมค่าใช้จ่ายรายเดือนของแมว | ผู้รับเลี้ยงมีเวลาดูแลเพียงพอ | แมวตัวนี้ไม่เคยเลี้ยงกับเด็กหรืออาจไม่เหมาะกับเด็กเล็ก | ประสบการณ์ต่ำกว่าที่แนะนำเล็กน้อย','2026-08-11 12:45:17'),(51,5,7,100.00,100.00,'highly_suitable',1,NULL,'แมวสามารถเข้ากับเด็กได้ดี | แมวสามารถเข้ากับแมวตัวอื่นได้ดี | พื้นที่ของผู้รับเลี้ยงเพียงพอต่อความต้องการของแมว | งบประมาณครอบคลุมค่าใช้จ่ายรายเดือนของแมว | ผู้รับเลี้ยงมีเวลาดูแลเพียงพอ | ผู้รับเลี้ยงมีประสบการณ์เหมาะสม','2026-08-11 12:49:05'),(52,5,5,100.00,100.00,'highly_suitable',1,NULL,'แมวสามารถเข้ากับเด็กได้ดี | แมวสามารถเข้ากับแมวตัวอื่นได้ดี | พื้นที่ของผู้รับเลี้ยงเพียงพอต่อความต้องการของแมว | งบประมาณครอบคลุมค่าใช้จ่ายรายเดือนของแมว | ผู้รับเลี้ยงมีเวลาดูแลเพียงพอ | ผู้รับเลี้ยงมีประสบการณ์เหมาะสม','2026-08-11 12:49:14'),(53,5,7,100.00,100.00,'highly_suitable',1,NULL,'แมวสามารถเข้ากับเด็กได้ดี | แมวสามารถเข้ากับแมวตัวอื่นได้ดี | พื้นที่ของผู้รับเลี้ยงเพียงพอต่อความต้องการของแมว | งบประมาณครอบคลุมค่าใช้จ่ายรายเดือนของแมว | ผู้รับเลี้ยงมีเวลาดูแลเพียงพอ | ผู้รับเลี้ยงมีประสบการณ์เหมาะสม','2026-08-11 12:49:21'),(54,5,7,100.00,100.00,'highly_suitable',1,NULL,'แมวสามารถเข้ากับเด็กได้ดี | แมวสามารถเข้ากับแมวตัวอื่นได้ดี | พื้นที่ของผู้รับเลี้ยงเพียงพอต่อความต้องการของแมว | งบประมาณครอบคลุมค่าใช้จ่ายรายเดือนของแมว | ผู้รับเลี้ยงมีเวลาดูแลเพียงพอ | ผู้รับเลี้ยงมีประสบการณ์เหมาะสม','2026-08-11 12:49:41'),(55,5,7,100.00,100.00,'highly_suitable',1,NULL,'แมวสามารถเข้ากับเด็กได้ดี | แมวสามารถเข้ากับแมวตัวอื่นได้ดี | พื้นที่ของผู้รับเลี้ยงเพียงพอต่อความต้องการของแมว | งบประมาณครอบคลุมค่าใช้จ่ายรายเดือนของแมว | ผู้รับเลี้ยงมีเวลาดูแลเพียงพอ | ผู้รับเลี้ยงมีประสบการณ์เหมาะสม','2026-08-11 13:04:07'),(56,5,4,62.50,62.50,'suitable',0,NULL,'พื้นที่ของผู้รับเลี้ยงเพียงพอต่อความต้องการของแมว | งบประมาณครอบคลุมค่าใช้จ่ายรายเดือนของแมว | แมวตัวนี้ไม่เคยเลี้ยงกับเด็กหรืออาจไม่เหมาะกับเด็กเล็ก | เวลาดูแลต่ำกว่าที่แมวต้องการเล็กน้อย | ประสบการณ์ต่ำกว่าที่แมวต้องการมาก | แมวตัวนี้ต้องการเลี้ยงเดี่ยว ไม่เหมาะกับบ้านที่มีแมว','2026-08-11 13:05:09'),(59,2,6,82.50,82.50,'highly_suitable',1,NULL,'พื้นที่ของผู้รับเลี้ยงเพียงพอต่อความต้องการของแมว | ผู้รับเลี้ยงมีเวลาดูแลเพียงพอ | ผู้รับเลี้ยงมีประสบการณ์เหมาะสม | งบประมาณอาจไม่เพียงพอต่อค่าใช้จ่าย','2026-08-11 13:14:53'),(60,2,9,82.50,82.50,'highly_suitable',1,NULL,'พื้นที่ของผู้รับเลี้ยงเพียงพอต่อความต้องการของแมว | ผู้รับเลี้ยงมีเวลาดูแลเพียงพอ | ผู้รับเลี้ยงมีประสบการณ์เหมาะสม | งบประมาณอาจไม่เพียงพอต่อค่าใช้จ่าย','2026-08-11 13:14:58'),(61,2,5,82.50,82.50,'highly_suitable',1,NULL,'พื้นที่ของผู้รับเลี้ยงเพียงพอต่อความต้องการของแมว | ผู้รับเลี้ยงมีเวลาดูแลเพียงพอ | ผู้รับเลี้ยงมีประสบการณ์เหมาะสม | งบประมาณอาจไม่เพียงพอต่อค่าใช้จ่าย','2026-08-11 13:15:06'),(62,2,4,82.50,82.50,'highly_suitable',1,NULL,'พื้นที่ของผู้รับเลี้ยงเพียงพอต่อความต้องการของแมว | ผู้รับเลี้ยงมีเวลาดูแลเพียงพอ | ผู้รับเลี้ยงมีประสบการณ์เหมาะสม | งบประมาณอาจไม่เพียงพอต่อค่าใช้จ่าย','2026-08-11 13:15:12'),(63,2,9,87.50,87.50,'highly_suitable',1,NULL,'แมวสามารถเข้ากับแมวตัวอื่นได้ดี | พื้นที่ของผู้รับเลี้ยงเพียงพอต่อความต้องการของแมว | ผู้รับเลี้ยงมีเวลาดูแลเพียงพอ | ผู้รับเลี้ยงมีประสบการณ์เหมาะสม | แมวตัวนี้ไม่เคยเลี้ยงกับเด็กหรืออาจไม่เหมาะกับเด็กเล็ก | งบประมาณอาจไม่เพียงพอต่อค่าใช้จ่าย','2026-08-11 13:15:44'),(65,2,6,82.50,82.50,'highly_suitable',1,NULL,'พื้นที่ของผู้รับเลี้ยงเพียงพอต่อความต้องการของแมว | ผู้รับเลี้ยงมีเวลาดูแลเพียงพอ | ผู้รับเลี้ยงมีประสบการณ์เหมาะสม | แมวตัวนี้ไม่เคยเลี้ยงกับเด็กหรืออาจไม่เหมาะกับเด็กเล็ก | แมวตัวนี้ไม่เคยเลี้ยงรวมกับแมวอื่น | งบประมาณอาจไม่เพียงพอต่อค่าใช้จ่าย','2026-08-11 13:15:56'),(66,2,5,92.50,92.50,'highly_suitable',1,NULL,'แมวสามารถเข้ากับเด็กได้ดี | แมวสามารถเข้ากับแมวตัวอื่นได้ดี | พื้นที่ของผู้รับเลี้ยงเพียงพอต่อความต้องการของแมว | ผู้รับเลี้ยงมีเวลาดูแลเพียงพอ | ผู้รับเลี้ยงมีประสบการณ์เหมาะสม | งบประมาณอาจไม่เพียงพอต่อค่าใช้จ่าย','2026-08-11 13:16:01'),(67,2,4,82.50,82.50,'highly_suitable',0,NULL,'พื้นที่ของผู้รับเลี้ยงเพียงพอต่อความต้องการของแมว | ผู้รับเลี้ยงมีเวลาดูแลเพียงพอ | ผู้รับเลี้ยงมีประสบการณ์เหมาะสม | แมวตัวนี้ไม่เคยเลี้ยงกับเด็กหรืออาจไม่เหมาะกับเด็กเล็ก | งบประมาณอาจไม่เพียงพอต่อค่าใช้จ่าย | แมวตัวนี้ต้องการเลี้ยงเดี่ยว ไม่เหมาะกับบ้านที่มีแมว','2026-08-11 13:16:09'),(68,2,4,82.50,82.50,'highly_suitable',0,NULL,'พื้นที่ของผู้รับเลี้ยงเพียงพอต่อความต้องการของแมว | ผู้รับเลี้ยงมีเวลาดูแลเพียงพอ | ผู้รับเลี้ยงมีประสบการณ์เหมาะสม | แมวตัวนี้ไม่เคยเลี้ยงกับเด็กหรืออาจไม่เหมาะกับเด็กเล็ก | งบประมาณอาจไม่เพียงพอต่อค่าใช้จ่าย | แมวตัวนี้ต้องการเลี้ยงเดี่ยว ไม่เหมาะกับบ้านที่มีแมว','2026-08-11 13:17:11'),(69,2,5,80.00,80.00,'highly_suitable',1,NULL,'แมวสามารถเข้ากับเด็กได้ดี | แมวสามารถเข้ากับแมวตัวอื่นได้ดี | พื้นที่ของผู้รับเลี้ยงเพียงพอต่อความต้องการของแมว | ผู้รับเลี้ยงมีประสบการณ์เหมาะสม | งบประมาณอาจไม่เพียงพอต่อค่าใช้จ่าย | เวลาดูแลต่ำกว่าที่แมวต้องการเล็กน้อย','2026-08-11 13:20:06'),(70,2,9,75.00,75.00,'suitable',1,NULL,'แมวสามารถเข้ากับแมวตัวอื่นได้ดี | พื้นที่ของผู้รับเลี้ยงเพียงพอต่อความต้องการของแมว | ผู้รับเลี้ยงมีประสบการณ์เหมาะสม | แมวตัวนี้ไม่เคยเลี้ยงกับเด็กหรืออาจไม่เหมาะกับเด็กเล็ก | งบประมาณอาจไม่เพียงพอต่อค่าใช้จ่าย | เวลาดูแลต่ำกว่าที่แมวต้องการเล็กน้อย','2026-08-11 13:20:13'),(72,2,6,57.50,57.50,'consider',0,NULL,'พื้นที่ของผู้รับเลี้ยงเพียงพอต่อความต้องการของแมว | ผู้รับเลี้ยงมีประสบการณ์เหมาะสม | แมวตัวนี้ไม่เคยเลี้ยงกับเด็กหรืออาจไม่เหมาะกับเด็กเล็ก | แมวตัวนี้ไม่เคยเลี้ยงรวมกับแมวอื่น | งบประมาณอาจไม่เพียงพอต่อค่าใช้จ่าย | เวลาดูแลต่ำกว่าที่แมวต้องการมาก | ไม่มีเวลาดูแลเพียงพอ','2026-08-11 13:20:24'),(73,2,4,57.50,57.50,'consider',0,NULL,'พื้นที่ของผู้รับเลี้ยงเพียงพอต่อความต้องการของแมว | ผู้รับเลี้ยงมีประสบการณ์เหมาะสม | แมวตัวนี้ไม่เคยเลี้ยงกับเด็กหรืออาจไม่เหมาะกับเด็กเล็ก | งบประมาณอาจไม่เพียงพอต่อค่าใช้จ่าย | เวลาดูแลต่ำกว่าที่แมวต้องการมาก | แมวตัวนี้ต้องการเลี้ยงเดี่ยว ไม่เหมาะกับบ้านที่มีแมว | ไม่มีเวลาดูแลเพียงพอ','2026-08-11 13:20:33'),(74,2,4,70.00,70.00,'suitable',1,NULL,'พื้นที่ของผู้รับเลี้ยงเพียงพอต่อความต้องการของแมว | ผู้รับเลี้ยงมีประสบการณ์เหมาะสม | แมวตัวนี้ไม่เคยเลี้ยงกับเด็กหรืออาจไม่เหมาะกับเด็กเล็ก | งบประมาณอาจไม่เพียงพอต่อค่าใช้จ่าย | เวลาดูแลต่ำกว่าที่แมวต้องการเล็กน้อย','2026-08-11 13:20:56'),(75,2,9,82.50,82.50,'highly_suitable',1,NULL,'พื้นที่ของผู้รับเลี้ยงเพียงพอต่อความต้องการของแมว | ผู้รับเลี้ยงมีเวลาดูแลเพียงพอ | ผู้รับเลี้ยงมีประสบการณ์เหมาะสม | แมวตัวนี้ไม่เคยเลี้ยงกับเด็กหรืออาจไม่เหมาะกับเด็กเล็ก | งบประมาณอาจไม่เพียงพอต่อค่าใช้จ่าย','2026-08-11 13:21:10'),(77,2,6,70.00,70.00,'suitable',1,NULL,'พื้นที่ของผู้รับเลี้ยงเพียงพอต่อความต้องการของแมว | ผู้รับเลี้ยงมีประสบการณ์เหมาะสม | แมวตัวนี้ไม่เคยเลี้ยงกับเด็กหรืออาจไม่เหมาะกับเด็กเล็ก | งบประมาณอาจไม่เพียงพอต่อค่าใช้จ่าย | เวลาดูแลต่ำกว่าที่แมวต้องการเล็กน้อย','2026-08-11 13:21:20'),(78,2,5,87.50,87.50,'highly_suitable',1,NULL,'แมวสามารถเข้ากับเด็กได้ดี | พื้นที่ของผู้รับเลี้ยงเพียงพอต่อความต้องการของแมว | ผู้รับเลี้ยงมีเวลาดูแลเพียงพอ | ผู้รับเลี้ยงมีประสบการณ์เหมาะสม | งบประมาณอาจไม่เพียงพอต่อค่าใช้จ่าย','2026-08-11 13:21:26'),(79,2,4,70.00,70.00,'suitable',1,NULL,'พื้นที่ของผู้รับเลี้ยงเพียงพอต่อความต้องการของแมว | ผู้รับเลี้ยงมีประสบการณ์เหมาะสม | แมวตัวนี้ไม่เคยเลี้ยงกับเด็กหรืออาจไม่เหมาะกับเด็กเล็ก | งบประมาณอาจไม่เพียงพอต่อค่าใช้จ่าย | เวลาดูแลต่ำกว่าที่แมวต้องการเล็กน้อย','2026-08-11 13:21:30'),(81,2,6,70.00,70.00,'suitable',1,NULL,'พื้นที่ของผู้รับเลี้ยงเพียงพอต่อความต้องการของแมว | ผู้รับเลี้ยงมีประสบการณ์เหมาะสม | แมวตัวนี้ไม่เคยเลี้ยงกับเด็กหรืออาจไม่เหมาะกับเด็กเล็ก | งบประมาณอาจไม่เพียงพอต่อค่าใช้จ่าย | เวลาดูแลต่ำกว่าที่แมวต้องการเล็กน้อย','2026-08-11 13:25:12'),(82,2,4,87.50,87.50,'highly_suitable',1,NULL,'พื้นที่ของผู้รับเลี้ยงเพียงพอต่อความต้องการของแมว | งบประมาณครอบคลุมค่าใช้จ่ายรายเดือนของแมว | ผู้รับเลี้ยงมีประสบการณ์เหมาะสม | แมวตัวนี้ไม่เคยเลี้ยงกับเด็กหรืออาจไม่เหมาะกับเด็กเล็ก | เวลาดูแลต่ำกว่าที่แมวต้องการเล็กน้อย','2026-08-11 13:25:52'),(83,2,4,87.50,87.50,'highly_suitable',1,NULL,'พื้นที่ของผู้รับเลี้ยงเพียงพอต่อความต้องการของแมว | งบประมาณครอบคลุมค่าใช้จ่ายรายเดือนของแมว | ผู้รับเลี้ยงมีประสบการณ์เหมาะสม | แมวตัวนี้ไม่เคยเลี้ยงกับเด็กหรืออาจไม่เหมาะกับเด็กเล็ก | เวลาดูแลต่ำกว่าที่แมวต้องการเล็กน้อย','2026-08-11 13:26:01'),(84,2,9,100.00,100.00,'highly_suitable',1,NULL,'พื้นที่ของผู้รับเลี้ยงเพียงพอต่อความต้องการของแมว | งบประมาณครอบคลุมค่าใช้จ่ายรายเดือนของแมว | ผู้รับเลี้ยงมีเวลาดูแลเพียงพอ | ผู้รับเลี้ยงมีประสบการณ์เหมาะสม | แมวตัวนี้ไม่เคยเลี้ยงกับเด็กหรืออาจไม่เหมาะกับเด็กเล็ก','2026-08-11 13:26:08'),(86,2,6,87.50,87.50,'highly_suitable',1,NULL,'พื้นที่ของผู้รับเลี้ยงเพียงพอต่อความต้องการของแมว | งบประมาณครอบคลุมค่าใช้จ่ายรายเดือนของแมว | ผู้รับเลี้ยงมีประสบการณ์เหมาะสม | แมวตัวนี้ไม่เคยเลี้ยงกับเด็กหรืออาจไม่เหมาะกับเด็กเล็ก | เวลาดูแลต่ำกว่าที่แมวต้องการเล็กน้อย','2026-08-11 13:26:18'),(87,2,5,100.00,100.00,'highly_suitable',1,NULL,'แมวสามารถเข้ากับเด็กได้ดี | พื้นที่ของผู้รับเลี้ยงเพียงพอต่อความต้องการของแมว | งบประมาณครอบคลุมค่าใช้จ่ายรายเดือนของแมว | ผู้รับเลี้ยงมีเวลาดูแลเพียงพอ | ผู้รับเลี้ยงมีประสบการณ์เหมาะสม','2026-08-11 13:26:25'),(88,2,6,87.50,87.50,'highly_suitable',1,NULL,'พื้นที่ของผู้รับเลี้ยงเพียงพอต่อความต้องการของแมว | งบประมาณครอบคลุมค่าใช้จ่ายรายเดือนของแมว | ผู้รับเลี้ยงมีประสบการณ์เหมาะสม | แมวตัวนี้ไม่เคยเลี้ยงกับเด็กหรืออาจไม่เหมาะกับเด็กเล็ก | เวลาดูแลต่ำกว่าที่แมวต้องการเล็กน้อย','2026-08-11 13:26:37'),(90,5,9,92.50,92.50,'highly_suitable',1,NULL,'แมวสามารถเข้ากับแมวตัวอื่นได้ดี | พื้นที่ของผู้รับเลี้ยงเพียงพอต่อความต้องการของแมว | งบประมาณครอบคลุมค่าใช้จ่ายรายเดือนของแมว | ผู้รับเลี้ยงมีเวลาดูแลเพียงพอ | แมวตัวนี้ไม่เคยเลี้ยงกับเด็กหรืออาจไม่เหมาะกับเด็กเล็ก | ประสบการณ์ต่ำกว่าที่แนะนำเล็กน้อย','2026-08-11 14:15:43'),(91,5,9,92.50,92.50,'highly_suitable',1,NULL,'แมวสามารถเข้ากับแมวตัวอื่นได้ดี | พื้นที่ของผู้รับเลี้ยงเพียงพอต่อความต้องการของแมว | งบประมาณครอบคลุมค่าใช้จ่ายรายเดือนของแมว | ผู้รับเลี้ยงมีเวลาดูแลเพียงพอ | แมวตัวนี้ไม่เคยเลี้ยงกับเด็กหรืออาจไม่เหมาะกับเด็กเล็ก | ประสบการณ์ต่ำกว่าที่แนะนำเล็กน้อย','2026-08-11 14:15:57'),(92,5,9,92.50,92.50,'highly_suitable',1,NULL,'แมวสามารถเข้ากับแมวตัวอื่นได้ดี | พื้นที่ของผู้รับเลี้ยงเพียงพอต่อความต้องการของแมว | งบประมาณครอบคลุมค่าใช้จ่ายรายเดือนของแมว | ผู้รับเลี้ยงมีเวลาดูแลเพียงพอ | แมวตัวนี้ไม่เคยเลี้ยงกับเด็กหรืออาจไม่เหมาะกับเด็กเล็ก | ประสบการณ์ต่ำกว่าที่แนะนำเล็กน้อย','2026-08-11 14:16:02'),(93,5,9,92.50,92.50,'highly_suitable',1,NULL,'แมวสามารถเข้ากับแมวตัวอื่นได้ดี | พื้นที่ของผู้รับเลี้ยงเพียงพอต่อความต้องการของแมว | งบประมาณครอบคลุมค่าใช้จ่ายรายเดือนของแมว | ผู้รับเลี้ยงมีเวลาดูแลเพียงพอ | แมวตัวนี้ไม่เคยเลี้ยงกับเด็กหรืออาจไม่เหมาะกับเด็กเล็ก | ประสบการณ์ต่ำกว่าที่แนะนำเล็กน้อย','2026-08-11 14:24:47'),(94,4,4,87.50,87.50,'highly_suitable',0,NULL,'พื้นที่ของผู้รับเลี้ยงเพียงพอต่อความต้องการของแมว | งบประมาณครอบคลุมค่าใช้จ่ายรายเดือนของแมว | ผู้รับเลี้ยงมีประสบการณ์เหมาะสม | แมวตัวนี้ไม่เคยเลี้ยงกับเด็กหรืออาจไม่เหมาะกับเด็กเล็ก | เวลาดูแลต่ำกว่าที่แมวต้องการเล็กน้อย | แมวตัวนี้ต้องการเลี้ยงเดี่ยว ไม่เหมาะกับบ้านที่มีแมว','2026-08-11 15:07:06'),(95,4,1,97.50,97.50,'highly_suitable',1,NULL,'แมวสามารถเข้ากับเด็กได้ดี | แมวสามารถเข้ากับแมวตัวอื่นได้ดี | พื้นที่ของผู้รับเลี้ยงเพียงพอต่อความต้องการของแมว | งบประมาณครอบคลุมค่าใช้จ่ายรายเดือนของแมว | ผู้รับเลี้ยงมีประสบการณ์เหมาะสม | เวลาดูแลต่ำกว่าที่แมวต้องการเล็กน้อย','2026-08-11 15:07:11'),(96,4,6,87.50,87.50,'highly_suitable',1,NULL,'พื้นที่ของผู้รับเลี้ยงเพียงพอต่อความต้องการของแมว | งบประมาณครอบคลุมค่าใช้จ่ายรายเดือนของแมว | ผู้รับเลี้ยงมีประสบการณ์เหมาะสม | แมวตัวนี้ไม่เคยเลี้ยงกับเด็กหรืออาจไม่เหมาะกับเด็กเล็ก | แมวตัวนี้ไม่เคยเลี้ยงรวมกับแมวอื่น | เวลาดูแลต่ำกว่าที่แมวต้องการเล็กน้อย','2026-08-11 15:07:18'),(97,4,5,100.00,100.00,'highly_suitable',1,NULL,'แมวสามารถเข้ากับเด็กได้ดี | แมวสามารถเข้ากับแมวตัวอื่นได้ดี | พื้นที่ของผู้รับเลี้ยงเพียงพอต่อความต้องการของแมว | งบประมาณครอบคลุมค่าใช้จ่ายรายเดือนของแมว | ผู้รับเลี้ยงมีเวลาดูแลเพียงพอ | ผู้รับเลี้ยงมีประสบการณ์เหมาะสม','2026-08-11 16:57:19'),(98,6,10,75.00,75.00,'suitable',1,NULL,'พื้นที่ของผู้รับเลี้ยงเพียงพอต่อความต้องการของแมว | งบประมาณครอบคลุมค่าใช้จ่ายรายเดือนของแมว | เวลาดูแลต่ำกว่าที่แมวต้องการเล็กน้อย | ประสบการณ์ต่ำกว่าที่แนะนำเล็กน้อย','2026-08-11 19:17:57'),(99,4,4,87.50,87.50,'highly_suitable',0,NULL,'พื้นที่ของผู้รับเลี้ยงเพียงพอต่อความต้องการของแมว | งบประมาณครอบคลุมค่าใช้จ่ายรายเดือนของแมว | ผู้รับเลี้ยงมีประสบการณ์เหมาะสม | แมวตัวนี้ไม่เคยเลี้ยงกับเด็กหรืออาจไม่เหมาะกับเด็กเล็ก | เวลาดูแลต่ำกว่าที่แมวต้องการเล็กน้อย | แมวตัวนี้ต้องการเลี้ยงเดี่ยว ไม่เหมาะกับบ้านที่มีแมว','2026-08-11 19:22:36'),(100,4,11,100.00,100.00,'highly_suitable',1,NULL,'แมวสามารถเข้ากับแมวตัวอื่นได้ดี | พื้นที่ของผู้รับเลี้ยงเพียงพอต่อความต้องการของแมว | งบประมาณครอบคลุมค่าใช้จ่ายรายเดือนของแมว | ผู้รับเลี้ยงมีเวลาดูแลเพียงพอ | ผู้รับเลี้ยงมีประสบการณ์เหมาะสม | แมวตัวนี้ไม่เคยเลี้ยงกับเด็กหรืออาจไม่เหมาะกับเด็กเล็ก','2026-08-13 09:20:27'),(101,4,5,100.00,100.00,'highly_suitable',1,NULL,'แมวสามารถเข้ากับเด็กได้ดี | แมวสามารถเข้ากับแมวตัวอื่นได้ดี | พื้นที่ของผู้รับเลี้ยงเพียงพอต่อความต้องการของแมว | งบประมาณครอบคลุมค่าใช้จ่ายรายเดือนของแมว | ผู้รับเลี้ยงมีเวลาดูแลเพียงพอ | ผู้รับเลี้ยงมีประสบการณ์เหมาะสม','2026-08-13 09:20:34'),(102,4,4,87.50,87.50,'highly_suitable',0,NULL,'พื้นที่ของผู้รับเลี้ยงเพียงพอต่อความต้องการของแมว | งบประมาณครอบคลุมค่าใช้จ่ายรายเดือนของแมว | ผู้รับเลี้ยงมีประสบการณ์เหมาะสม | แมวตัวนี้ไม่เคยเลี้ยงกับเด็กหรืออาจไม่เหมาะกับเด็กเล็ก | เวลาดูแลต่ำกว่าที่แมวต้องการเล็กน้อย | แมวตัวนี้ต้องการเลี้ยงเดี่ยว ไม่เหมาะกับบ้านที่มีแมว','2026-08-13 09:20:40'),(103,4,3,100.00,100.00,'highly_suitable',1,NULL,'แมวสามารถเข้ากับเด็กได้ดี | พื้นที่ของผู้รับเลี้ยงเพียงพอต่อความต้องการของแมว | งบประมาณครอบคลุมค่าใช้จ่ายรายเดือนของแมว | ผู้รับเลี้ยงมีเวลาดูแลเพียงพอ | ผู้รับเลี้ยงมีประสบการณ์เหมาะสม | แมวตัวนี้ไม่เคยเลี้ยงรวมกับแมวอื่น','2026-08-13 09:20:45'),(104,4,1,97.50,97.50,'highly_suitable',1,NULL,'แมวสามารถเข้ากับเด็กได้ดี | แมวสามารถเข้ากับแมวตัวอื่นได้ดี | พื้นที่ของผู้รับเลี้ยงเพียงพอต่อความต้องการของแมว | งบประมาณครอบคลุมค่าใช้จ่ายรายเดือนของแมว | ผู้รับเลี้ยงมีประสบการณ์เหมาะสม | เวลาดูแลต่ำกว่าที่แมวต้องการเล็กน้อย','2026-08-13 09:20:51'),(105,4,11,92.50,92.50,'highly_suitable',1,NULL,'แมวสามารถเข้ากับแมวตัวอื่นได้ดี | งบประมาณครอบคลุมค่าใช้จ่ายรายเดือนของแมว | ผู้รับเลี้ยงมีเวลาดูแลเพียงพอ | ผู้รับเลี้ยงมีประสบการณ์เหมาะสม | แมวตัวนี้ไม่เคยเลี้ยงกับเด็กหรืออาจไม่เหมาะกับเด็กเล็ก | พื้นที่ต่ำกว่าที่แมวต้องการเล็กน้อย','2026-08-13 09:21:19'),(106,4,3,100.00,100.00,'highly_suitable',1,NULL,'แมวสามารถเข้ากับเด็กได้ดี | พื้นที่ของผู้รับเลี้ยงเพียงพอต่อความต้องการของแมว | งบประมาณครอบคลุมค่าใช้จ่ายรายเดือนของแมว | ผู้รับเลี้ยงมีเวลาดูแลเพียงพอ | ผู้รับเลี้ยงมีประสบการณ์เหมาะสม | แมวตัวนี้ไม่เคยเลี้ยงรวมกับแมวอื่น','2026-08-13 09:21:25');
/*!40000 ALTER TABLE `assessments` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `catphotos`
--

DROP TABLE IF EXISTS `catphotos`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `catphotos` (
  `photo_id` int NOT NULL AUTO_INCREMENT,
  `cat_id` int NOT NULL,
  `image_url` text COLLATE utf8mb4_unicode_ci,
  PRIMARY KEY (`photo_id`),
  KEY `cat_id` (`cat_id`),
  CONSTRAINT `catphotos_ibfk_1` FOREIGN KEY (`cat_id`) REFERENCES `cats` (`cat_id`) ON DELETE CASCADE
) ENGINE=InnoDB AUTO_INCREMENT=17 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `catphotos`
--

LOCK TABLES `catphotos` WRITE;
/*!40000 ALTER TABLE `catphotos` DISABLE KEYS */;
INSERT INTO `catphotos` VALUES (6,1,'http://10.0.2.2:3000/upload/cats/cat-1786377353419-432803366.jpg'),(8,3,'http://10.0.2.2:3000/upload/cats/cat-1786379199364-698082471.jpg'),(9,4,'http://10.0.2.2:3000/upload/cats/cat-1786379519395-470191425.jpg'),(10,5,'http://10.0.2.2:3000/upload/cats/cat-1786379582052-443329779.jpg'),(11,6,'http://10.0.2.2:3000/upload/cats/cat-1786379728815-213083535.jpg'),(12,7,'http://10.0.2.2:3000/upload/cats/cat-1786379899099-74419896.jpg'),(14,9,'http://10.0.2.2:3000/upload/cats/cat-1786422414740-336544360.jpg'),(15,10,'/upload/cats/cat-1786441932879-301289792.jpg'),(16,11,'/upload/cats/cat-1786450653872-23237232.jpg');
/*!40000 ALTER TABLE `catphotos` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `cats`
--

DROP TABLE IF EXISTS `cats`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `cats` (
  `cat_id` int NOT NULL AUTO_INCREMENT,
  `poster_id` int NOT NULL,
  `pet_name` varchar(100) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `pet_breed` varchar(100) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `gender` enum('male','female') COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `age_months` decimal(10,0) DEFAULT NULL,
  `is_sterilized` varchar(100) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `is_vaccinated` varchar(100) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `personality` text COLLATE utf8mb4_unicode_ci,
  `health_note` text COLLATE utf8mb4_unicode_ci,
  `req_space_level` enum('small','medium','large') COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `req_attention` enum('low','medium','high') COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `req_experience_level` enum('low','medium','high') COLLATE utf8mb4_unicode_ci DEFAULT 'low',
  `status` enum('available','pending','adopted') COLLATE utf8mb4_unicode_ci DEFAULT 'available',
  `est_monthly_cost` decimal(10,2) DEFAULT NULL,
  `created_at` timestamp NULL DEFAULT CURRENT_TIMESTAMP,
  `good_with_children` tinyint(1) DEFAULT '1',
  `good_with_cats` tinyint(1) DEFAULT '1',
  `good_with_dogs` tinyint(1) DEFAULT '1',
  `has_special_needs` tinyint(1) DEFAULT '0',
  PRIMARY KEY (`cat_id`),
  KEY `poster_id` (`poster_id`),
  CONSTRAINT `cats_ibfk_1` FOREIGN KEY (`poster_id`) REFERENCES `users` (`user_id`)
) ENGINE=InnoDB AUTO_INCREMENT=12 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `cats`
--

LOCK TABLES `cats` WRITE;
/*!40000 ALTER TABLE `cats` DISABLE KEYS */;
INSERT INTO `cats` VALUES (1,2,'ฟูฟู','เปอร์เซีย','female',36,'ทำแล้ว','ฉีดครบแล้ว','เข้ากับสัตว์อื่น: เข้ากันได้ดี',NULL,'small','high','low','available',3000.00,'2026-08-10 15:18:03',1,1,0,0),(3,2,'เทาเทา','สีสวาด','male',4,'ยังไม่ทำ','ยังไม่ฉีด','เข้ากับสัตว์อื่น: เข้ากันได้ดี',NULL,'medium','low','low','available',3000.00,'2026-08-10 16:26:38',1,0,1,0),(4,3,'มอมแมม','ไม่ทราบสายพันธุ์','male',36,'ทำแล้ว','ฉีดครบแล้ว','เข้ากับสัตว์อื่น: ต้องการเลี้ยงเดี่ยว','ป่วยบ่อย ไม่แข็งแรง','small','high','high','available',3000.00,'2026-08-10 16:31:58',0,0,0,1),(5,3,'ไอขาว','ขาวมณี','male',36,'ยังไม่ทำ','ยังไม่ฉีด','เข้ากับสัตว์อื่น: เข้ากันได้ดี',NULL,'medium','medium','low','available',3000.00,'2026-08-10 16:33:01',1,1,0,0),(6,3,'โก้โก้','ศุภลักษณ์','female',36,'ทำแล้ว','ฉีดครบแล้ว','เข้ากับสัตว์อื่น: ไม่เคยเลี้ยงรวม','เป็นนิ่ว ต้องกินอาหารพิเศษแมวเป็นนิ่ว','small','high','high','available',3000.00,'2026-08-10 16:35:27',0,0,0,1),(7,4,'ปลาเผา','สก็อตติช โฟลด์','male',9,'ยังไม่ทำ','ยังไม่ฉีด','เข้ากับสัตว์อื่น: เข้ากันได้ดี',NULL,'medium','low','low','adopted',3000.00,'2026-08-10 16:38:18',1,1,1,0),(9,4,'เจ๋งแจ๋ว','แมวไทย','male',96,'ทำแล้ว','ฉีดครบแล้ว','เข้ากับสัตว์อื่น: เข้ากันได้ดี','เป็นแมวสูงอายุ ป่วยบ่อย ต้องทานอาหารแมวสูงวัย','medium','medium','medium','available',3000.00,'2026-08-11 04:26:53',0,1,0,0),(10,4,'หน้าไหม้','วิเชียรมาศ','female',4,'ยังไม่ทำ','ยังไม่ฉีด','เข้ากับสัตว์อื่น: เข้ากันได้ดี',NULL,'medium','high','medium','available',3000.00,'2026-08-11 09:52:11',0,1,0,0),(11,6,'test','เปอร์เซีย','female',9,'ทำแล้ว','ยังไม่ฉีด','เข้ากับสัตว์อื่น: เข้ากันได้ดี',NULL,'large','medium','medium','available',3000.00,'2026-08-11 12:17:32',0,1,0,0);
/*!40000 ALTER TABLE `cats` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `conversations`
--

DROP TABLE IF EXISTS `conversations`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `conversations` (
  `room_id` int NOT NULL AUTO_INCREMENT,
  `match_id` int NOT NULL,
  `created_at` datetime DEFAULT CURRENT_TIMESTAMP,
  PRIMARY KEY (`room_id`),
  KEY `match_id` (`match_id`),
  CONSTRAINT `conversations_ibfk_1` FOREIGN KEY (`match_id`) REFERENCES `adoptionapplications` (`match_id`) ON DELETE CASCADE
) ENGINE=InnoDB AUTO_INCREMENT=6 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `conversations`
--

LOCK TABLES `conversations` WRITE;
/*!40000 ALTER TABLE `conversations` DISABLE KEYS */;
INSERT INTO `conversations` VALUES (3,3,'2026-08-11 13:04:09'),(4,4,'2026-08-11 15:07:33');
/*!40000 ALTER TABLE `conversations` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `evaluation_criteria`
--

DROP TABLE IF EXISTS `evaluation_criteria`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `evaluation_criteria` (
  `criteria_id` int NOT NULL AUTO_INCREMENT,
  `criteria_code` varchar(50) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `criteria_name` varchar(100) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `admin_id` int NOT NULL,
  `profile_field` varchar(50) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `condition_value` varchar(100) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `updated` datetime DEFAULT CURRENT_TIMESTAMP,
  `criteria_type` enum('score','rule') COLLATE utf8mb4_unicode_ci DEFAULT 'score',
  `comparison_type` enum('level','ratio','boolean','exact') COLLATE utf8mb4_unicode_ci DEFAULT 'exact',
  `score_ratio` decimal(5,2) DEFAULT '0.00',
  `max_score` decimal(5,2) DEFAULT '25.00',
  `is_blocking` tinyint(1) DEFAULT '0',
  `is_active` tinyint(1) DEFAULT '1',
  PRIMARY KEY (`criteria_id`),
  UNIQUE KEY `uq_criteria_condition` (`criteria_code`,`condition_value`),
  KEY `admin_id` (`admin_id`),
  CONSTRAINT `evaluation_criteria_ibfk_1` FOREIGN KEY (`admin_id`) REFERENCES `users` (`user_id`)
) ENGINE=InnoDB AUTO_INCREMENT=14 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `evaluation_criteria`
--

LOCK TABLES `evaluation_criteria` WRITE;
/*!40000 ALTER TABLE `evaluation_criteria` DISABLE KEYS */;
INSERT INTO `evaluation_criteria` VALUES (1,'SPACE','พื้นที่ในการเลี้ยง',1,'space_level','equal_or_higher','2026-08-11 12:02:30','score','level',1.00,25.00,0,1),(2,'SPACE','พื้นที่ในการเลี้ยง',1,'space_level','lower_one_level','2026-08-11 12:02:30','score','level',0.50,25.00,0,1),(3,'SPACE','พื้นที่ในการเลี้ยง',1,'space_level','lower_two_levels','2026-08-11 12:02:30','score','level',0.00,25.00,1,1),(4,'BUDGET','งบประมาณต่อเดือน',1,'monthly_budget','ratio_gte_1','2026-08-11 12:02:30','score','ratio',1.00,25.00,0,1),(5,'BUDGET','งบประมาณต่อเดือน',1,'monthly_budget','ratio_080_099','2026-08-11 12:02:30','score','ratio',0.70,25.00,0,1),(6,'BUDGET','งบประมาณต่อเดือน',1,'monthly_budget','ratio_060_079','2026-08-11 12:02:30','score','ratio',0.30,25.00,0,1),(7,'BUDGET','งบประมาณต่อเดือน',1,'monthly_budget','ratio_lt_060','2026-08-11 12:02:30','score','ratio',0.00,25.00,1,1),(8,'ATTENTION','เวลาในการดูแล',1,'attention_level','equal_or_higher','2026-08-11 12:02:30','score','level',1.00,25.00,0,1),(9,'ATTENTION','เวลาในการดูแล',1,'attention_level','lower_one_level','2026-08-11 12:02:30','score','level',0.50,25.00,0,1),(10,'ATTENTION','เวลาในการดูแล',1,'attention_level','lower_two_levels','2026-08-11 12:02:30','score','level',0.00,25.00,1,1),(11,'EXPERIENCE','ประสบการณ์ในการเลี้ยง',1,'experience_level','equal_or_higher','2026-08-11 12:02:30','score','level',1.00,25.00,0,1),(12,'EXPERIENCE','ประสบการณ์ในการเลี้ยง',1,'experience_level','lower_one_level','2026-08-11 12:02:30','score','level',0.50,25.00,0,1),(13,'EXPERIENCE','ประสบการณ์ในการเลี้ยง',1,'experience_level','lower_two_levels','2026-08-11 12:02:30','score','level',0.00,25.00,1,1);
/*!40000 ALTER TABLE `evaluation_criteria` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `messages`
--

DROP TABLE IF EXISTS `messages`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `messages` (
  `message_id` int NOT NULL AUTO_INCREMENT,
  `room_id` int NOT NULL,
  `sender_id` int NOT NULL,
  `message_text` text COLLATE utf8mb4_unicode_ci NOT NULL,
  `is_read` tinyint(1) DEFAULT '0',
  `sent_at` datetime DEFAULT CURRENT_TIMESTAMP,
  PRIMARY KEY (`message_id`),
  KEY `room_id` (`room_id`),
  KEY `sender_id` (`sender_id`),
  CONSTRAINT `messages_ibfk_1` FOREIGN KEY (`room_id`) REFERENCES `conversations` (`room_id`) ON DELETE CASCADE,
  CONSTRAINT `messages_ibfk_2` FOREIGN KEY (`sender_id`) REFERENCES `users` (`user_id`) ON DELETE CASCADE
) ENGINE=InnoDB AUTO_INCREMENT=9 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `messages`
--

LOCK TABLES `messages` WRITE;
/*!40000 ALTER TABLE `messages` DISABLE KEYS */;
INSERT INTO `messages` VALUES (4,3,5,'น้องน่ารักจังงงงงงง',1,'2026-08-11 13:04:34'),(5,3,5,'ซนมั้ยคะ',1,'2026-08-11 13:04:50'),(6,3,4,'ไม่ซนนนน',1,'2026-08-11 13:50:06'),(7,4,4,'ขอเลี้ยงแมว',1,'2026-08-11 15:07:56');
/*!40000 ALTER TABLE `messages` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `user_profiles`
--

DROP TABLE IF EXISTS `user_profiles`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `user_profiles` (
  `profile_id` int NOT NULL AUTO_INCREMENT,
  `user_id` int NOT NULL,
  `living_space_type` enum('house','condo','apartment') COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `space_size` enum('small','medium','large') COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `max_monthly_budget` decimal(10,2) DEFAULT NULL,
  `daily_free_hours` enum('low','medium','high') COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `has_other_pets` tinyint(1) DEFAULT NULL,
  `has_children` tinyint(1) DEFAULT NULL,
  `experience` enum('none','beginner','experienced') COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  PRIMARY KEY (`profile_id`),
  KEY `user_id` (`user_id`),
  CONSTRAINT `user_profiles_ibfk_1` FOREIGN KEY (`user_id`) REFERENCES `users` (`user_id`) ON DELETE CASCADE
) ENGINE=InnoDB AUTO_INCREMENT=5 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `user_profiles`
--

LOCK TABLES `user_profiles` WRITE;
/*!40000 ALTER TABLE `user_profiles` DISABLE KEYS */;
INSERT INTO `user_profiles` VALUES (1,5,'apartment','medium',3000.00,'medium',1,1,'beginner'),(2,2,'apartment','medium',5000.00,'medium',0,1,'experienced'),(3,4,'condo','medium',3500.00,'medium',1,1,'experienced'),(4,6,'apartment','medium',5000.00,'medium',0,0,'beginner');
/*!40000 ALTER TABLE `user_profiles` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `users`
--

DROP TABLE IF EXISTS `users`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `users` (
  `user_id` int NOT NULL AUTO_INCREMENT,
  `email` varchar(100) COLLATE utf8mb4_unicode_ci NOT NULL,
  `password` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `fullname` varchar(100) COLLATE utf8mb4_unicode_ci NOT NULL,
  `username` varchar(50) COLLATE utf8mb4_unicode_ci NOT NULL,
  `phonenumber` varchar(15) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `line_id` varchar(50) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `role` enum('user','admin') COLLATE utf8mb4_unicode_ci NOT NULL DEFAULT 'user',
  `created_at` datetime DEFAULT CURRENT_TIMESTAMP,
  `updated_at` datetime DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP,
  PRIMARY KEY (`user_id`),
  UNIQUE KEY `email` (`email`),
  UNIQUE KEY `username` (`username`)
) ENGINE=InnoDB AUTO_INCREMENT=7 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `users`
--

LOCK TABLES `users` WRITE;
/*!40000 ALTER TABLE `users` DISABLE KEYS */;
INSERT INTO `users` VALUES (1,'Admin@gmail.com','admin123456','ผู้ดูแลระบบ','Admin','0888888888','adminhome','admin','2026-08-10 22:12:37','2026-08-10 22:12:37'),(2,'kit@gmail.com','$2b$10$m4eWng9IIphw9fEZxOF3wuVx558QQYHeAmyHtqQysrVqrFjZGKDk2','กิตติ ตั้งใจดี','kitti','0987863711','0987863711','user','2026-08-10 22:16:10','2026-08-10 22:16:10'),(3,'sak@gmail.com','$2b$10$ujjt9fvOcCwb2urGeoRoAu0OMHFZoWRftILBr1zLc0jzf8iWdOJkW','สมศักดิ์ รักแมว','Somsak','0879563411','-','user','2026-08-10 23:28:57','2026-08-10 23:28:57'),(4,'lee@gmail.com','$2b$10$F9Bubn6833dKisvxUG8vG.NeQu1Yx.prxJBCU8iaq7OP38soTHC0e','มาลี มีแมว','Malee','0865478542',NULL,'user','2026-08-10 23:36:48','2026-08-10 23:36:48'),(5,'s@gmail.com','$2b$10$gFlQSN7UU7kVcVYsizaUcOFCse5o/p/l0KhqyzAqImatzrKUdbA9i','สุดา พาเพลิน','Suda111','0987890511',NULL,'user','2026-08-10 23:40:56','2026-08-10 23:40:56'),(6,'t@gmail.com','$2b$10$Dy38XilyCLMJQ7oKMIXcgOJC/vEn0xJWWinPAZJJSTL7ZT3bMyL2y','test tt','test','0987654321',NULL,'user','2026-08-11 19:15:51','2026-08-11 19:15:51');
/*!40000 ALTER TABLE `users` ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2026-09-17 11:40:25
